export interface Commune {
  id: string;
  name: string;
}

export interface Wilaya {
  id: string;
  code: number;
  name: string;
  communes: Commune[];
}

export const wilayas: Wilaya[] = [
  {
    "id": "01",
    "code": 1,
    "name": "أدرار",
    "communes": [
      {
        "id": "01001",
        "name": "أدرار"
      },
      {
        "id": "01002",
        "name": "تأماست"
      },
      {
        "id": "01004",
        "name": "رڨان"
      },
      {
        "id": "01005",
        "name": "ان زغمير"
      },
      {
        "id": "01006",
        "name": "تــيـــت"
      },
      {
        "id": "01008",
        "name": "تسابيت"
      },
      {
        "id": "01011",
        "name": "زاوية كنتة"
      },
      {
        "id": "01012",
        "name": "أولف"
      },
      {
        "id": "01013",
        "name": "تيمقتن"
      },
      {
        "id": "01014",
        "name": "تامنطيت"
      },
      {
        "id": "01015",
        "name": "فنوغيل"
      },
      {
        "id": "01018",
        "name": "سالى"
      },
      {
        "id": "01019",
        "name": "أقبلي"
      },
      {
        "id": "01021",
        "name": "أولاد أحمد تيمى"
      },
      {
        "id": "01022",
        "name": "بودة"
      },
      {
        "id": "01026",
        "name": "السبع"
      }
    ]
  },
  {
    "id": "02",
    "code": 2,
    "name": "الشلف",
    "communes": [
      {
        "id": "02001",
        "name": "الشلف"
      },
      {
        "id": "02002",
        "name": "تنس"
      },
      {
        "id": "02003",
        "name": "بنايرية"
      },
      {
        "id": "02004",
        "name": "الكريمية"
      },
      {
        "id": "02005",
        "name": "تاجنة"
      },
      {
        "id": "02006",
        "name": "تاوقريت"
      },
      {
        "id": "02007",
        "name": "بني حواء"
      },
      {
        "id": "02008",
        "name": "صبحة"
      },
      {
        "id": "02009",
        "name": "حرشون"
      },
      {
        "id": "02010",
        "name": "أولاد فارس"
      },
      {
        "id": "02011",
        "name": "سيدي عكاشة"
      },
      {
        "id": "02012",
        "name": "بوقدير"
      },
      {
        "id": "02013",
        "name": "بني راشد"
      },
      {
        "id": "02014",
        "name": "تلعصة"
      },
      {
        "id": "02015",
        "name": "الهرنفة"
      },
      {
        "id": "02016",
        "name": "واد ڨوسين"
      },
      {
        "id": "02017",
        "name": "الظهرة"
      },
      {
        "id": "02018",
        "name": "أولاد عباس"
      },
      {
        "id": "02019",
        "name": "سنجاس"
      },
      {
        "id": "02020",
        "name": "الزبوجة"
      },
      {
        "id": "02021",
        "name": "واد سلي"
      },
      {
        "id": "02022",
        "name": "أبو الحسن"
      },
      {
        "id": "02023",
        "name": "المرصى"
      },
      {
        "id": "02024",
        "name": "الشطية"
      },
      {
        "id": "02025",
        "name": "سيدي عبد الرحمان"
      },
      {
        "id": "02026",
        "name": "مصدق"
      },
      {
        "id": "02027",
        "name": "الحجاج"
      },
      {
        "id": "02028",
        "name": "الأبيض مجاجة"
      },
      {
        "id": "02029",
        "name": "واد الفضة"
      },
      {
        "id": "02030",
        "name": "أولاد بن عبد القادر"
      },
      {
        "id": "02031",
        "name": "بوزغاية"
      },
      {
        "id": "02032",
        "name": "عين مران"
      },
      {
        "id": "02033",
        "name": "أم الذروع"
      },
      {
        "id": "02034",
        "name": "بريرة"
      },
      {
        "id": "02035",
        "name": "بني بوعتاب"
      }
    ]
  },
  {
    "id": "03",
    "code": 3,
    "name": "الأغواط",
    "communes": [
      {
        "id": "03001",
        "name": "الأغواط"
      },
      {
        "id": "03002",
        "name": "قصر الحيران"
      },
      {
        "id": "03003",
        "name": "بن ناصر بن شهرة"
      },
      {
        "id": "03004",
        "name": "سيدي مخلوف"
      },
      {
        "id": "03005",
        "name": "حاسي دلاعة"
      },
      {
        "id": "03006",
        "name": "حاسي الرمل"
      },
      {
        "id": "03007",
        "name": "عــيــن مـــاضــي"
      },
      {
        "id": "03008",
        "name": "تاجموت"
      },
      {
        "id": "03009",
        "name": "الخنق"
      },
      {
        "id": "03015",
        "name": "الحاج المشري"
      },
      {
        "id": "03017",
        "name": "تاويالة"
      },
      {
        "id": "03018",
        "name": "تاجرونة"
      },
      {
        "id": "03020",
        "name": "العسافية"
      },
      {
        "id": "03022",
        "name": "وادي مزي"
      },
      {
        "id": "03023",
        "name": "الهوارية"
      }
    ]
  },
  {
    "id": "04",
    "code": 4,
    "name": "أم البواقي",
    "communes": [
      {
        "id": "04001",
        "name": "أم البواقي"
      },
      {
        "id": "04002",
        "name": "عين البيضاء"
      },
      {
        "id": "04003",
        "name": "عين مليلة"
      },
      {
        "id": "04004",
        "name": "بحير الشرڨي"
      },
      {
        "id": "04005",
        "name": "العامرية"
      },
      {
        "id": "04006",
        "name": "سيقوس"
      },
      {
        "id": "04007",
        "name": "البلالة"
      },
      {
        "id": "04008",
        "name": "عين بابوش"
      },
      {
        "id": "04009",
        "name": "بريش"
      },
      {
        "id": "04010",
        "name": "أولاد حملة"
      },
      {
        "id": "04011",
        "name": "الضلعة"
      },
      {
        "id": "04012",
        "name": "عين كرشة"
      },
      {
        "id": "04013",
        "name": "هنشير تومغني"
      },
      {
        "id": "04014",
        "name": "الجازيـــــــة"
      },
      {
        "id": "04015",
        "name": "عين الديس"
      },
      {
        "id": "04016",
        "name": "فكرينة"
      },
      {
        "id": "04017",
        "name": "سوق نعمان"
      },
      {
        "id": "04018",
        "name": "الزرڨ"
      },
      {
        "id": "04019",
        "name": "الفجوج بوغرارة سعودى"
      },
      {
        "id": "04020",
        "name": "أولاد زواي"
      },
      {
        "id": "04021",
        "name": "بئر الشهداء"
      },
      {
        "id": "04022",
        "name": "قصر صباحي"
      },
      {
        "id": "04023",
        "name": "وادي نيني"
      },
      {
        "id": "04024",
        "name": "مسكيانة"
      },
      {
        "id": "04025",
        "name": "عين فكرون"
      },
      {
        "id": "04026",
        "name": "الراحية"
      },
      {
        "id": "04027",
        "name": "عين الزيتون"
      },
      {
        "id": "04028",
        "name": "أولاد ڨاسم"
      },
      {
        "id": "04029",
        "name": "الحرملية"
      }
    ]
  },
  {
    "id": "05",
    "code": 5,
    "name": "باتنة",
    "communes": [
      {
        "id": "05001",
        "name": "باتنة"
      },
      {
        "id": "05002",
        "name": "غسيرة"
      },
      {
        "id": "05003",
        "name": "معافة"
      },
      {
        "id": "05004",
        "name": "مروانة"
      },
      {
        "id": "05005",
        "name": "سريانة"
      },
      {
        "id": "05006",
        "name": "منعة"
      },
      {
        "id": "05008",
        "name": "تازولت"
      },
      {
        "id": "05009",
        "name": "نڨاوس"
      },
      {
        "id": "05010",
        "name": "قيقبة"
      },
      {
        "id": "05011",
        "name": "إينوغيسن"
      },
      {
        "id": "05012",
        "name": "عيون العصافير"
      },
      {
        "id": "05015",
        "name": "عزيل عبد القادر"
      },
      {
        "id": "05016",
        "name": "اريس"
      },
      {
        "id": "05017",
        "name": "كيمل"
      },
      {
        "id": "05018",
        "name": "تيلاطو"
      },
      {
        "id": "05019",
        "name": "عين جاسر"
      },
      {
        "id": "05020",
        "name": "أولاد سلام"
      },
      {
        "id": "05021",
        "name": "تيغرغار"
      },
      {
        "id": "05022",
        "name": "عين ياقوت"
      },
      {
        "id": "05023",
        "name": "فسديس"
      },
      {
        "id": "05024",
        "name": "سفيان"
      },
      {
        "id": "05025",
        "name": "الرحبات"
      },
      {
        "id": "05026",
        "name": "تيغانمين"
      },
      {
        "id": "05027",
        "name": "لمسان"
      },
      {
        "id": "05028",
        "name": "قصر بلازمة"
      },
      {
        "id": "05030",
        "name": "ايشمول"
      },
      {
        "id": "05031",
        "name": "فم الطوب"
      },
      {
        "id": "05032",
        "name": "بنى فضالة الحقانية"
      },
      {
        "id": "05033",
        "name": "واد الماء"
      },
      {
        "id": "05034",
        "name": "تالخمت"
      },
      {
        "id": "05035",
        "name": "بوزينة"
      },
      {
        "id": "05036",
        "name": "الشمرة"
      },
      {
        "id": "05037",
        "name": "واد الشعبة"
      },
      {
        "id": "05038",
        "name": "تاكسلانت"
      },
      {
        "id": "05039",
        "name": "القصبات"
      },
      {
        "id": "05040",
        "name": "أولاد عوف"
      },
      {
        "id": "05041",
        "name": "بــومقر"
      },
      {
        "id": "05043",
        "name": "الجزار"
      },
      {
        "id": "05044",
        "name": "تكوت"
      },
      {
        "id": "05045",
        "name": "عين التوتة"
      },
      {
        "id": "05046",
        "name": "حيدوسة"
      },
      {
        "id": "05047",
        "name": "نية العابد"
      },
      {
        "id": "05048",
        "name": "وادي الطاقة"
      },
      {
        "id": "05049",
        "name": "أولاد فاضل"
      },
      {
        "id": "05050",
        "name": "تيمقاد"
      },
      {
        "id": "05051",
        "name": "رأس العيون"
      },
      {
        "id": "05052",
        "name": "شير"
      },
      {
        "id": "05053",
        "name": "أولاد سي سليمان"
      },
      {
        "id": "05054",
        "name": "زانة البيضاء"
      },
      {
        "id": "05055",
        "name": "أمدوكال"
      },
      {
        "id": "05057",
        "name": "الحاسي"
      },
      {
        "id": "05058",
        "name": "لازرو"
      },
      {
        "id": "05059",
        "name": "بومية"
      },
      {
        "id": "05060",
        "name": "بولهيلات"
      },
      {
        "id": "05061",
        "name": "الاربعاء"
      }
    ]
  },
  {
    "id": "06",
    "code": 6,
    "name": "بجاية",
    "communes": [
      {
        "id": "06001",
        "name": "بجاية"
      },
      {
        "id": "06002",
        "name": "اميزور"
      },
      {
        "id": "06003",
        "name": "فرعون"
      },
      {
        "id": "06004",
        "name": "تاوريرت اغيل"
      },
      {
        "id": "06005",
        "name": "شلاطة"
      },
      {
        "id": "06006",
        "name": "تامقرة"
      },
      {
        "id": "06007",
        "name": "تيمزريت"
      },
      {
        "id": "06008",
        "name": "ﺳﻮق اﻻﺛﻨﻴﻦ"
      },
      {
        "id": "06009",
        "name": "مسيسنة"
      },
      {
        "id": "06010",
        "name": "تينبذار"
      },
      {
        "id": "06011",
        "name": "تيشي"
      },
      {
        "id": "06012",
        "name": "سمعون"
      },
      {
        "id": "06013",
        "name": "كنديرة"
      },
      {
        "id": "06014",
        "name": "تيفرة"
      },
      {
        "id": "06015",
        "name": "إغرم"
      },
      {
        "id": "06016",
        "name": "امالو"
      },
      {
        "id": "06017",
        "name": "إغيل على"
      },
      {
        "id": "06018",
        "name": "افناين الماثن"
      },
      {
        "id": "06019",
        "name": "توجة"
      },
      {
        "id": "06020",
        "name": "درقينة"
      },
      {
        "id": "06021",
        "name": "سيدي عياد"
      },
      {
        "id": "06022",
        "name": "أوقاس"
      },
      {
        "id": "06023",
        "name": "آيث جليل"
      },
      {
        "id": "06024",
        "name": "آدكار"
      },
      {
        "id": "06025",
        "name": "أقبو"
      },
      {
        "id": "06026",
        "name": "صدوق"
      },
      {
        "id": "06027",
        "name": "تازمالت"
      },
      {
        "id": "06028",
        "name": "آيت أرزين"
      },
      {
        "id": "06029",
        "name": "شميني"
      },
      {
        "id": "06030",
        "name": "سوق أوفلة"
      },
      {
        "id": "06031",
        "name": "تاسقريوت"
      },
      {
        "id": "06032",
        "name": "طيبان"
      },
      {
        "id": "06033",
        "name": "ثالة حمزة"
      },
      {
        "id": "06034",
        "name": "برباشة"
      },
      {
        "id": "06035",
        "name": "بنى كسيلة"
      },
      {
        "id": "06036",
        "name": "أوزلاقن"
      },
      {
        "id": "06037",
        "name": "بوحمزة"
      },
      {
        "id": "06038",
        "name": "بنى مليكش"
      },
      {
        "id": "06039",
        "name": "سيدي عيش"
      },
      {
        "id": "06040",
        "name": "القصر"
      },
      {
        "id": "06041",
        "name": "ملبو"
      },
      {
        "id": "06042",
        "name": "اكفادو"
      },
      {
        "id": "06043",
        "name": "لفلاى"
      },
      {
        "id": "06044",
        "name": "خراطة"
      },
      {
        "id": "06045",
        "name": "ذراع القايد"
      },
      {
        "id": "06046",
        "name": "تامريجت"
      },
      {
        "id": "06047",
        "name": "آيت سماعيل"
      },
      {
        "id": "06048",
        "name": "بوخليفة"
      },
      {
        "id": "06049",
        "name": "تيزى نبربر"
      },
      {
        "id": "06050",
        "name": "بني معوش"
      },
      {
        "id": "06051",
        "name": "وادي غير"
      },
      {
        "id": "06052",
        "name": "بوجليل"
      }
    ]
  },
  {
    "id": "07",
    "code": 7,
    "name": "بسكرة",
    "communes": [
      {
        "id": "07001",
        "name": "بسكرة"
      },
      {
        "id": "07002",
        "name": "أوماش"
      },
      {
        "id": "07004",
        "name": "شتمة"
      },
      {
        "id": "07010",
        "name": "أولاد رحمة"
      },
      {
        "id": "07011",
        "name": "سيدي عقبة"
      },
      {
        "id": "07012",
        "name": "مشونش"
      },
      {
        "id": "07013",
        "name": "الحوش"
      },
      {
        "id": "07014",
        "name": "عين الناقة"
      },
      {
        "id": "07015",
        "name": "زريبة الوادي"
      },
      {
        "id": "07016",
        "name": "الفيض"
      },
      {
        "id": "07020",
        "name": "جمورة"
      },
      {
        "id": "07021",
        "name": "طولقة"
      },
      {
        "id": "07022",
        "name": "لواء"
      },
      {
        "id": "07023",
        "name": "لشانة"
      },
      {
        "id": "07024",
        "name": "أورلال"
      },
      {
        "id": "07025",
        "name": "مليلي"
      },
      {
        "id": "07026",
        "name": "فوغالة"
      },
      {
        "id": "07027",
        "name": "برج بن عزوز"
      },
      {
        "id": "07028",
        "name": "مزيرعة"
      },
      {
        "id": "07029",
        "name": "بوشقرون"
      },
      {
        "id": "07030",
        "name": "مخادمة"
      },
      {
        "id": "07031",
        "name": "الغروس"
      },
      {
        "id": "07032",
        "name": "الحاجب"
      },
      {
        "id": "07033",
        "name": "خنڨة سيدي ناجي"
      }
    ]
  },
  {
    "id": "08",
    "code": 8,
    "name": "بشار",
    "communes": [
      {
        "id": "08001",
        "name": "بشار"
      },
      {
        "id": "08002",
        "name": "عرق فراج"
      },
      {
        "id": "08004",
        "name": "مريجة"
      },
      {
        "id": "08006",
        "name": "لحمر"
      },
      {
        "id": "08008",
        "name": "بني يخلف"
      },
      {
        "id": "08009",
        "name": "مشرع ھوارى بومدين"
      },
      {
        "id": "08010",
        "name": "القنادسة"
      },
      {
        "id": "08012",
        "name": "تبلبالة"
      },
      {
        "id": "08013",
        "name": "تــــاغـيــث"
      },
      {
        "id": "08015",
        "name": "بوكايس"
      },
      {
        "id": "08016",
        "name": "موغل"
      },
      {
        "id": "08017",
        "name": "العبادلة"
      },
      {
        "id": "08020",
        "name": "تامترت"
      },
      {
        "id": "08021",
        "name": "بني ونيف"
      }
    ]
  },
  {
    "id": "09",
    "code": 9,
    "name": "البليدة",
    "communes": [
      {
        "id": "09001",
        "name": "البليدة‎"
      },
      {
        "id": "09002",
        "name": "الشبلي"
      },
      {
        "id": "09003",
        "name": "بوعينان"
      },
      {
        "id": "09004",
        "name": "واد العلايڨ"
      },
      {
        "id": "09007",
        "name": "اولاد يعيش"
      },
      {
        "id": "09008",
        "name": "الشريعة"
      },
      {
        "id": "09010",
        "name": "العفرون"
      },
      {
        "id": "09011",
        "name": "الشفة"
      },
      {
        "id": "09012",
        "name": "حمام ملوان"
      },
      {
        "id": "09013",
        "name": "بني خليل"
      },
      {
        "id": "09014",
        "name": "صومعة"
      },
      {
        "id": "09016",
        "name": "موزاية"
      },
      {
        "id": "09017",
        "name": "صوحان"
      },
      {
        "id": "09018",
        "name": "مفتاح"
      },
      {
        "id": "09019",
        "name": "أولاد سلامة"
      },
      {
        "id": "09020",
        "name": "بوفاريك"
      },
      {
        "id": "09021",
        "name": "الاربعاء"
      },
      {
        "id": "09022",
        "name": "واد جر"
      },
      {
        "id": "09023",
        "name": "بني تامو"
      },
      {
        "id": "09024",
        "name": "بوعرفة"
      },
      {
        "id": "09025",
        "name": "بني مراد"
      },
      {
        "id": "09026",
        "name": "بوڨرة"
      },
      {
        "id": "09027",
        "name": "ڨرواو"
      },
      {
        "id": "09028",
        "name": "عين الرمانة"
      },
      {
        "id": "09029",
        "name": "جبابرة"
      }
    ]
  },
  {
    "id": "10",
    "code": 10,
    "name": "البويرة",
    "communes": [
      {
        "id": "10001",
        "name": "البويرة"
      },
      {
        "id": "10002",
        "name": "الأصنام"
      },
      {
        "id": "10003",
        "name": "قرومة"
      },
      {
        "id": "10004",
        "name": "سوق الخميس"
      },
      {
        "id": "10005",
        "name": "قادرية"
      },
      {
        "id": "10006",
        "name": "احنيف"
      },
      {
        "id": "10007",
        "name": "ديــرة"
      },
      {
        "id": "10008",
        "name": "آيت لعزيز"
      },
      {
        "id": "10009",
        "name": "تاغزوت"
      },
      {
        "id": "10010",
        "name": "الروراوة"
      },
      {
        "id": "10011",
        "name": "مسدور"
      },
      {
        "id": "10012",
        "name": "حيزر"
      },
      {
        "id": "10013",
        "name": "الأخضرية"
      },
      {
        "id": "10014",
        "name": "معالة"
      },
      {
        "id": "10015",
        "name": "الھاشمية"
      },
      {
        "id": "10016",
        "name": "أعمر"
      },
      {
        "id": "10017",
        "name": "الشرفاء"
      },
      {
        "id": "10018",
        "name": "برج أوخريص"
      },
      {
        "id": "10019",
        "name": "العجيبة"
      },
      {
        "id": "10020",
        "name": "الحاكمية"
      },
      {
        "id": "10021",
        "name": "الخبوزية"
      },
      {
        "id": "10022",
        "name": "أھل القصر"
      },
      {
        "id": "10023",
        "name": "بودربالة"
      },
      {
        "id": "10024",
        "name": "زبربر"
      },
      {
        "id": "10025",
        "name": "عين الحجر"
      },
      {
        "id": "10026",
        "name": "الجباحية"
      },
      {
        "id": "10027",
        "name": "أغبالو"
      },
      {
        "id": "10028",
        "name": "تاڨديت"
      },
      {
        "id": "10029",
        "name": "عين الترك"
      },
      {
        "id": "10030",
        "name": "الصهاريج"
      },
      {
        "id": "10031",
        "name": "الدشمية"
      },
      {
        "id": "10032",
        "name": "ريدان"
      },
      {
        "id": "10033",
        "name": "بشلول"
      },
      {
        "id": "10034",
        "name": "بوكرام"
      },
      {
        "id": "10035",
        "name": "عين بسام"
      },
      {
        "id": "10036",
        "name": "بئر غبالو"
      },
      {
        "id": "10037",
        "name": "مشدا الله"
      },
      {
        "id": "10038",
        "name": "سور الغزلان"
      },
      {
        "id": "10039",
        "name": "المعمورة"
      },
      {
        "id": "10040",
        "name": "أولاد راشد"
      },
      {
        "id": "10041",
        "name": "عين العلوي"
      },
      {
        "id": "10042",
        "name": "الحجرة الزرقاء"
      },
      {
        "id": "10043",
        "name": "آث منصور"
      },
      {
        "id": "10044",
        "name": "المقراني"
      },
      {
        "id": "10045",
        "name": "وادى البردي"
      }
    ]
  },
  {
    "id": "11",
    "code": 11,
    "name": "تمنراست",
    "communes": [
      {
        "id": "11001",
        "name": "تمنراست"
      },
      {
        "id": "11002",
        "name": "أبلسة"
      },
      {
        "id": "11005",
        "name": "إدلس"
      },
      {
        "id": "11006",
        "name": "تاظروك"
      },
      {
        "id": "11007",
        "name": "تين زاوتين"
      },
      {
        "id": "11009",
        "name": "ان أمقل"
      }
    ]
  },
  {
    "id": "12",
    "code": 12,
    "name": "تبسة",
    "communes": [
      {
        "id": "12001",
        "name": "تبسة"
      },
      {
        "id": "12003",
        "name": "الــشــريــعـة"
      },
      {
        "id": "12004",
        "name": "سطح قنطيس"
      },
      {
        "id": "12005",
        "name": "العوينات"
      },
      {
        "id": "12006",
        "name": "الحويجبات"
      },
      {
        "id": "12007",
        "name": "صفصاف الوسرة"
      },
      {
        "id": "12008",
        "name": "الحمامات"
      },
      {
        "id": "12010",
        "name": "بــئــر مــقـدم"
      },
      {
        "id": "12011",
        "name": "الكويف"
      },
      {
        "id": "12012",
        "name": "مرسط"
      },
      {
        "id": "12014",
        "name": "بٔير الذھب"
      },
      {
        "id": "12015",
        "name": "العقلة"
      },
      {
        "id": "12016",
        "name": "قوريقر"
      },
      {
        "id": "12017",
        "name": "بكارية"
      },
      {
        "id": "12018",
        "name": "بوخضرة"
      },
      {
        "id": "12019",
        "name": "الونزة"
      },
      {
        "id": "12020",
        "name": "الماء الأبيض"
      },
      {
        "id": "12021",
        "name": "أم على"
      },
      {
        "id": "12022",
        "name": "ثليجان"
      },
      {
        "id": "12023",
        "name": "عين الزرقاء"
      },
      {
        "id": "12024",
        "name": "المريج"
      },
      {
        "id": "12025",
        "name": "بولحاف الدير"
      },
      {
        "id": "12026",
        "name": "بجن"
      },
      {
        "id": "12027",
        "name": "المزرعة"
      }
    ]
  },
  {
    "id": "13",
    "code": 13,
    "name": "تلمسان",
    "communes": [
      {
        "id": "13001",
        "name": "تلمسان"
      },
      {
        "id": "13002",
        "name": "بني مستار"
      },
      {
        "id": "13003",
        "name": "عين تالوت"
      },
      {
        "id": "13004",
        "name": "الرمشي"
      },
      {
        "id": "13005",
        "name": "الفحول"
      },
      {
        "id": "13006",
        "name": "صبرة"
      },
      {
        "id": "13007",
        "name": "الغزوات"
      },
      {
        "id": "13008",
        "name": "السواني"
      },
      {
        "id": "13009",
        "name": "جبالة"
      },
      {
        "id": "13011",
        "name": "وادى الشولى"
      },
      {
        "id": "13012",
        "name": "عين فزّة"
      },
      {
        "id": "13013",
        "name": "أولاد ميمون"
      },
      {
        "id": "13014",
        "name": "عمير"
      },
      {
        "id": "13015",
        "name": "عين يوسف"
      },
      {
        "id": "13016",
        "name": "زناتة"
      },
      {
        "id": "13017",
        "name": "بنى سنوس"
      },
      {
        "id": "13018",
        "name": "باب العسة"
      },
      {
        "id": "13019",
        "name": "دار يغمراسن"
      },
      {
        "id": "13020",
        "name": "فلاوسن"
      },
      {
        "id": "13021",
        "name": "العزايل"
      },
      {
        "id": "13022",
        "name": "سبعة شيوخ"
      },
      {
        "id": "13023",
        "name": "تيرني بني هديل"
      },
      {
        "id": "13024",
        "name": "بن سكران"
      },
      {
        "id": "13025",
        "name": "عين نحالة"
      },
      {
        "id": "13026",
        "name": "الحناية"
      },
      {
        "id": "13027",
        "name": "مغنية"
      },
      {
        "id": "13028",
        "name": "حمام بوغرارة"
      },
      {
        "id": "13029",
        "name": "تونان"
      },
      {
        "id": "13030",
        "name": "مسيردة الفواقة"
      },
      {
        "id": "13031",
        "name": "عين فتاح"
      },
      {
        "id": "13033",
        "name": "سوق الثلاثاء"
      },
      {
        "id": "13034",
        "name": "سيدي العبدلي"
      },
      {
        "id": "13035",
        "name": "سبدو"
      },
      {
        "id": "13036",
        "name": "برج عريمة"
      },
      {
        "id": "13037",
        "name": "سيدي مجاهد"
      },
      {
        "id": "13038",
        "name": "بني بوسعيد"
      },
      {
        "id": "13039",
        "name": "مرسى بن مھيدي"
      },
      {
        "id": "13040",
        "name": "ندرومة"
      },
      {
        "id": "13041",
        "name": "سيدي الجيلالي"
      },
      {
        "id": "13042",
        "name": "بني بهدل"
      },
      {
        "id": "13043",
        "name": "البويھي"
      },
      {
        "id": "13044",
        "name": "هنين"
      },
      {
        "id": "13045",
        "name": "تيانت"
      },
      {
        "id": "13046",
        "name": "أولاد رياح"
      },
      {
        "id": "13047",
        "name": "بوحلو"
      },
      {
        "id": "13048",
        "name": "سوق الخميس"
      },
      {
        "id": "13049",
        "name": "عين غرابة"
      },
      {
        "id": "13050",
        "name": "شتوان"
      },
      {
        "id": "13051",
        "name": "المنصورة"
      },
      {
        "id": "13052",
        "name": "بني مستار"
      },
      {
        "id": "13053",
        "name": "عين الكبيرة"
      }
    ]
  },
  {
    "id": "14",
    "code": 14,
    "name": "تيارت",
    "communes": [
      {
        "id": "14001",
        "name": "تيارت‎"
      },
      {
        "id": "14002",
        "name": "مدروسة"
      },
      {
        "id": "14003",
        "name": "بوشقيف"
      },
      {
        "id": "14004",
        "name": "سيدي علي ملال"
      },
      {
        "id": "14005",
        "name": "عين زاريت"
      },
      {
        "id": "14006",
        "name": "عين الذهب"
      },
      {
        "id": "14007",
        "name": "سيدي بختي"
      },
      {
        "id": "14008",
        "name": "مدريسة"
      },
      {
        "id": "14009",
        "name": "زمالة الأمير عبد القادر"
      },
      {
        "id": "14010",
        "name": "مادنة"
      },
      {
        "id": "14011",
        "name": "السبت"
      },
      {
        "id": "14012",
        "name": "ملاكو"
      },
      {
        "id": "14013",
        "name": "دحموني"
      },
      {
        "id": "14014",
        "name": "رحوية"
      },
      {
        "id": "14015",
        "name": "المھدية"
      },
      {
        "id": "14016",
        "name": "سوقر"
      },
      {
        "id": "14018",
        "name": "عين الحديد"
      },
      {
        "id": "14019",
        "name": "اولاد جراد"
      },
      {
        "id": "14020",
        "name": "نعيمة"
      },
      {
        "id": "14021",
        "name": "مغيلة"
      },
      {
        "id": "14022",
        "name": "قرطوفة"
      },
      {
        "id": "14023",
        "name": "سيدي حسني"
      },
      {
        "id": "14024",
        "name": "جيلالي بن عمار"
      },
      {
        "id": "14025",
        "name": "سبعين"
      },
      {
        "id": "14026",
        "name": "توسنينة"
      },
      {
        "id": "14027",
        "name": "فرندة"
      },
      {
        "id": "14028",
        "name": "عين كرمس"
      },
      {
        "id": "14031",
        "name": "ملاكو"
      },
      {
        "id": "14032",
        "name": "تاقدمت"
      },
      {
        "id": "14033",
        "name": "وادى ليلى"
      },
      {
        "id": "14034",
        "name": "مشرع الصفاء"
      },
      {
        "id": "14036",
        "name": "شحيمة"
      },
      {
        "id": "14037",
        "name": "تاخمرت"
      },
      {
        "id": "14038",
        "name": "سيدي عبدالرحمان"
      },
      {
        "id": "14041",
        "name": "الفايجة"
      },
      {
        "id": "14042",
        "name": "تيدة"
      }
    ]
  },
  {
    "id": "15",
    "code": 15,
    "name": "تيزي وزو",
    "communes": [
      {
        "id": "15001",
        "name": "تيزي وزو"
      },
      {
        "id": "15002",
        "name": "عين الحمام"
      },
      {
        "id": "15003",
        "name": "أقبيل"
      },
      {
        "id": "15004",
        "name": "فريحة"
      },
      {
        "id": "15005",
        "name": "صوامع"
      },
      {
        "id": "15006",
        "name": "مشطراس"
      },
      {
        "id": "15007",
        "name": "إرجن"
      },
      {
        "id": "15008",
        "name": "تيميزارت"
      },
      {
        "id": "15009",
        "name": "ماكودة"
      },
      {
        "id": "15010",
        "name": "ذراع الميزان"
      },
      {
        "id": "15011",
        "name": "تيزي غنيف"
      },
      {
        "id": "15012",
        "name": "بونوح"
      },
      {
        "id": "15013",
        "name": "آيت شفعة"
      },
      {
        "id": "15014",
        "name": "فريقات"
      },
      {
        "id": "15015",
        "name": "بني عيسي"
      },
      {
        "id": "15016",
        "name": "أيت زمنزر"
      },
      {
        "id": "15017",
        "name": "إيفرحونن"
      },
      {
        "id": "15018",
        "name": "عزازقة"
      },
      {
        "id": "15019",
        "name": "إيلولة أمالو"
      },
      {
        "id": "15020",
        "name": "اعكورن"
      },
      {
        "id": "15021",
        "name": "الأربعاء نايت إيراثن"
      },
      {
        "id": "15022",
        "name": "تيزي راشد"
      },
      {
        "id": "15023",
        "name": "زكري"
      },
      {
        "id": "15024",
        "name": "واقنون"
      },
      {
        "id": "15025",
        "name": "عين الزاوية"
      },
      {
        "id": "15026",
        "name": "مكيرة"
      },
      {
        "id": "15027",
        "name": "أيت يحي"
      },
      {
        "id": "15028",
        "name": "أيت محمود"
      },
      {
        "id": "15029",
        "name": "المعاتقة"
      },
      {
        "id": "15030",
        "name": "آيت بومھدى"
      },
      {
        "id": "15031",
        "name": "أبي يوسف"
      },
      {
        "id": "15032",
        "name": "بني دوالة"
      },
      {
        "id": "15033",
        "name": "إليلتن"
      },
      {
        "id": "15034",
        "name": "بوزقن"
      },
      {
        "id": "15035",
        "name": "أيت أقواشة"
      },
      {
        "id": "15036",
        "name": "واضية"
      },
      {
        "id": "15037",
        "name": "أزفون"
      },
      {
        "id": "15038",
        "name": "تقزيرت"
      },
      {
        "id": "15039",
        "name": "آيت عيسى ميمون"
      },
      {
        "id": "15040",
        "name": "بوغني"
      },
      {
        "id": "15041",
        "name": "ايفيغاء"
      },
      {
        "id": "15042",
        "name": "آيت أومالو"
      },
      {
        "id": "15043",
        "name": "ترمتين"
      },
      {
        "id": "15044",
        "name": "أقرو"
      },
      {
        "id": "15045",
        "name": "يطافن"
      },
      {
        "id": "15046",
        "name": "بنى زيكى"
      },
      {
        "id": "15047",
        "name": "ذراع بن خدة"
      },
      {
        "id": "15048",
        "name": "واسيف"
      },
      {
        "id": "15049",
        "name": "آجر"
      },
      {
        "id": "15050",
        "name": "مقلع"
      },
      {
        "id": "15051",
        "name": "تيزي نثلاثة"
      },
      {
        "id": "15052",
        "name": "بني يني"
      },
      {
        "id": "15053",
        "name": "أغريب"
      },
      {
        "id": "15054",
        "name": "إفليسن"
      },
      {
        "id": "15055",
        "name": "بوجيمة"
      },
      {
        "id": "15056",
        "name": "أيت يحي موسى"
      },
      {
        "id": "15057",
        "name": "سوق الإثنين"
      },
      {
        "id": "15058",
        "name": "أيت خليلي"
      },
      {
        "id": "15059",
        "name": "سيدي نعمان"
      },
      {
        "id": "15060",
        "name": "أبودرارن"
      },
      {
        "id": "15061",
        "name": "آقنى قغران"
      },
      {
        "id": "15062",
        "name": "مزرانة"
      },
      {
        "id": "15063",
        "name": "إمسوحال"
      },
      {
        "id": "15064",
        "name": "تادمايت"
      },
      {
        "id": "15065",
        "name": "أيت بوعدو"
      },
      {
        "id": "15066",
        "name": "أسي يوسف"
      },
      {
        "id": "15067",
        "name": "أيت تودرت"
      }
    ]
  },
  {
    "id": "16",
    "code": 16,
    "name": "الجزائر",
    "communes": [
      {
        "id": "16001",
        "name": "الجزائر الوسطى"
      },
      {
        "id": "16002",
        "name": "سيدي امحمد"
      },
      {
        "id": "16003",
        "name": "المدنية"
      },
      {
        "id": "16004",
        "name": "بلوزداد"
      },
      {
        "id": "16005",
        "name": "باب الواد"
      },
      {
        "id": "16006",
        "name": "بولوغين"
      },
      {
        "id": "16007",
        "name": "القصبة"
      },
      {
        "id": "16008",
        "name": "وادي قريش"
      },
      {
        "id": "16009",
        "name": "بير مراد رايس"
      },
      {
        "id": "16010",
        "name": "الآبيار"
      },
      {
        "id": "16011",
        "name": "بوزريعة"
      },
      {
        "id": "16012",
        "name": "بئر خادم"
      },
      {
        "id": "16013",
        "name": "الحراش"
      },
      {
        "id": "16014",
        "name": "براقي"
      },
      {
        "id": "16015",
        "name": "وادي سمار"
      },
      {
        "id": "16016",
        "name": "بوروبة"
      },
      {
        "id": "16017",
        "name": "حسين داي"
      },
      {
        "id": "16018",
        "name": "القبة"
      },
      {
        "id": "16019",
        "name": "باش جراح"
      },
      {
        "id": "16020",
        "name": "الدار البيضاء"
      },
      {
        "id": "16021",
        "name": "باب الزوار"
      },
      {
        "id": "16022",
        "name": "بن عكنون"
      },
      {
        "id": "16023",
        "name": "دالي ابراهيم"
      },
      {
        "id": "16024",
        "name": "الحمامات"
      },
      {
        "id": "16025",
        "name": "الرايس حميدو"
      },
      {
        "id": "16026",
        "name": "جسر قسنطينة"
      },
      {
        "id": "16027",
        "name": "المرادية"
      },
      {
        "id": "16028",
        "name": "حيدرة"
      },
      {
        "id": "16029",
        "name": "المحمدية"
      },
      {
        "id": "16030",
        "name": "برج الكيفان"
      },
      {
        "id": "16031",
        "name": "المقرية"
      },
      {
        "id": "16032",
        "name": "بني مسوس"
      },
      {
        "id": "16033",
        "name": "الكليتوس"
      },
      {
        "id": "16034",
        "name": "بئر توتة"
      },
      {
        "id": "16035",
        "name": "تسالة المرجة"
      },
      {
        "id": "16036",
        "name": "أولاد الشبل"
      },
      {
        "id": "16037",
        "name": "سيدي موسى"
      },
      {
        "id": "16038",
        "name": "عين طاية"
      },
      {
        "id": "16039",
        "name": "برج البحري"
      },
      {
        "id": "16040",
        "name": "المرسى"
      },
      {
        "id": "16041",
        "name": "هراوة"
      },
      {
        "id": "16042",
        "name": "رويبة"
      },
      {
        "id": "16043",
        "name": "الرغاية"
      },
      {
        "id": "16044",
        "name": "عين بنيان"
      },
      {
        "id": "16045",
        "name": "سطاوالي"
      },
      {
        "id": "16046",
        "name": "زرالدة"
      },
      {
        "id": "16047",
        "name": "محالمة"
      },
      {
        "id": "16048",
        "name": "رحمانية"
      },
      {
        "id": "16049",
        "name": "سويدانية"
      },
      {
        "id": "16050",
        "name": "شراقة"
      },
      {
        "id": "16051",
        "name": "أولاد فايت"
      },
      {
        "id": "16052",
        "name": "العاشور"
      },
      {
        "id": "16053",
        "name": "درارية"
      },
      {
        "id": "16054",
        "name": "دويرة"
      },
      {
        "id": "16055",
        "name": "بابا حسن"
      },
      {
        "id": "16056",
        "name": "خرايسية"
      },
      {
        "id": "16057",
        "name": "السحاولة"
      }
    ]
  },
  {
    "id": "17",
    "code": 17,
    "name": "الجلفة",
    "communes": [
      {
        "id": "17001",
        "name": "الجلفة"
      },
      {
        "id": "17002",
        "name": "مجبرة"
      },
      {
        "id": "17003",
        "name": "القديد"
      },
      {
        "id": "17004",
        "name": "حاسي بحبح"
      },
      {
        "id": "17005",
        "name": "عين معبد"
      },
      {
        "id": "17007",
        "name": "فيض البطمة"
      },
      {
        "id": "17009",
        "name": "بويرة الأحداب"
      },
      {
        "id": "17010",
        "name": "زكار"
      },
      {
        "id": "17011",
        "name": "الخميس"
      },
      {
        "id": "17012",
        "name": "سيدي بايزيد"
      },
      {
        "id": "17013",
        "name": "المليليحة"
      },
      {
        "id": "17014",
        "name": "الإدريسية"
      },
      {
        "id": "17015",
        "name": "الدويس"
      },
      {
        "id": "17016",
        "name": "حاسي العش"
      },
      {
        "id": "17018",
        "name": "قتارة"
      },
      {
        "id": "17023",
        "name": "عين الشهداء"
      },
      {
        "id": "17024",
        "name": "ام العظام"
      },
      {
        "id": "17025",
        "name": "دار الشيوخ"
      },
      {
        "id": "17026",
        "name": "الشارف"
      },
      {
        "id": "17027",
        "name": "بن يعقوب"
      },
      {
        "id": "17028",
        "name": "الزعفران"
      },
      {
        "id": "17030",
        "name": "عين الابل"
      },
      {
        "id": "17034",
        "name": "عمورة"
      },
      {
        "id": "17036",
        "name": "تعضميت"
      }
    ]
  },
  {
    "id": "18",
    "code": 18,
    "name": "جيجل",
    "communes": [
      {
        "id": "18001",
        "name": "جيجل"
      },
      {
        "id": "18002",
        "name": "إراڨن"
      },
      {
        "id": "18003",
        "name": "العوانة"
      },
      {
        "id": "18004",
        "name": "زيامة منصورية"
      },
      {
        "id": "18005",
        "name": "الطاهير"
      },
      {
        "id": "18006",
        "name": "الامير عبد القادر"
      },
      {
        "id": "18007",
        "name": "الشقفة"
      },
      {
        "id": "18008",
        "name": "الشحنة"
      },
      {
        "id": "18009",
        "name": "الميلية"
      },
      {
        "id": "18010",
        "name": "سيدي معروف"
      },
      {
        "id": "18011",
        "name": "السطارة"
      },
      {
        "id": "18012",
        "name": "العنصر"
      },
      {
        "id": "18013",
        "name": "سيدي عبد العزيز"
      },
      {
        "id": "18014",
        "name": "قاوس"
      },
      {
        "id": "18015",
        "name": "غبالة"
      },
      {
        "id": "18016",
        "name": "بوراوي بلهادف"
      },
      {
        "id": "18017",
        "name": "جيملة"
      },
      {
        "id": "18018",
        "name": "سلمى بن زيادة"
      },
      {
        "id": "18019",
        "name": "أولاد عسكر"
      },
      {
        "id": "18020",
        "name": "القنار"
      },
      {
        "id": "18021",
        "name": "اولاد يحيى"
      },
      {
        "id": "18022",
        "name": "بودريعة بن ياجيس"
      },
      {
        "id": "18023",
        "name": "بني بلعيد"
      },
      {
        "id": "18024",
        "name": "تاكسنة"
      },
      {
        "id": "18025",
        "name": "الجمعة بني حبيبي"
      },
      {
        "id": "18026",
        "name": "برج الطهر"
      },
      {
        "id": "18027",
        "name": "ولاد رابح"
      },
      {
        "id": "18028",
        "name": "وجانة"
      }
    ]
  },
  {
    "id": "19",
    "code": 19,
    "name": "سطيف",
    "communes": [
      {
        "id": "19001",
        "name": "سطيف‎"
      },
      {
        "id": "19002",
        "name": "عين الكبيرة"
      },
      {
        "id": "19003",
        "name": "بني عزيز"
      },
      {
        "id": "19004",
        "name": "أولاد سي أحمد"
      },
      {
        "id": "19005",
        "name": "بوطالب"
      },
      {
        "id": "19006",
        "name": "عين الروى"
      },
      {
        "id": "19007",
        "name": "ذراع قبيلة"
      },
      {
        "id": "19008",
        "name": "بئر العرش"
      },
      {
        "id": "19009",
        "name": "بني شبانة"
      },
      {
        "id": "19010",
        "name": "أولاد تبــان"
      },
      {
        "id": "19011",
        "name": "حــامة"
      },
      {
        "id": "19012",
        "name": "معـاويـة"
      },
      {
        "id": "19013",
        "name": "عين لڨراج"
      },
      {
        "id": "19014",
        "name": "عين عباسـة"
      },
      {
        "id": "19015",
        "name": "الدهامشة"
      },
      {
        "id": "19016",
        "name": "بابور"
      },
      {
        "id": "19017",
        "name": "قجــال"
      },
      {
        "id": "19018",
        "name": "عين لحجـر"
      },
      {
        "id": "19019",
        "name": "بوسلام"
      },
      {
        "id": "19020",
        "name": "العلمة"
      },
      {
        "id": "19021",
        "name": "جميلـة"
      },
      {
        "id": "19022",
        "name": "بني ورتيلان"
      },
      {
        "id": "19023",
        "name": "الرصفة"
      },
      {
        "id": "19024",
        "name": "أولاد عدوان"
      },
      {
        "id": "19025",
        "name": "البلاعة"
      },
      {
        "id": "19026",
        "name": "عين أرنـات"
      },
      {
        "id": "19027",
        "name": "عموشة"
      },
      {
        "id": "19028",
        "name": "عين ولمان"
      },
      {
        "id": "19029",
        "name": "بيضاء برج"
      },
      {
        "id": "19030",
        "name": "بوعنداس"
      },
      {
        "id": "19031",
        "name": "بازر الصخرة"
      },
      {
        "id": "19032",
        "name": "حمــام السخنة"
      },
      {
        "id": "19033",
        "name": "مزلوق"
      },
      {
        "id": "19034",
        "name": "بئر حدادة"
      },
      {
        "id": "19035",
        "name": "سرج الغول"
      },
      {
        "id": "19036",
        "name": "حربيل"
      },
      {
        "id": "19037",
        "name": "الأورسية"
      },
      {
        "id": "19038",
        "name": "تيزي نبشار"
      },
      {
        "id": "19039",
        "name": "صـالح باي"
      },
      {
        "id": "19040",
        "name": "عين أزال"
      },
      {
        "id": "19041",
        "name": "ڨنزات"
      },
      {
        "id": "19042",
        "name": "تالة إيفاسن"
      },
      {
        "id": "19043",
        "name": "بوقاعـة"
      },
      {
        "id": "19044",
        "name": "بني فودة"
      },
      {
        "id": "19045",
        "name": "تاشودة"
      },
      {
        "id": "19046",
        "name": "إيث موحلي"
      },
      {
        "id": "19047",
        "name": "أولاد صـابر"
      },
      {
        "id": "19048",
        "name": "قلال"
      },
      {
        "id": "19049",
        "name": "عين السبت"
      },
      {
        "id": "19050",
        "name": "حمام قرقور"
      },
      {
        "id": "19051",
        "name": "آيت نوال مزادة"
      },
      {
        "id": "19052",
        "name": "قصرالأبطال"
      },
      {
        "id": "19053",
        "name": "بني حسين"
      },
      {
        "id": "19054",
        "name": "آيت تيزي"
      },
      {
        "id": "19055",
        "name": "موكلان"
      },
      {
        "id": "19056",
        "name": "القلتة الزرقاء"
      },
      {
        "id": "19057",
        "name": "واد البارد"
      },
      {
        "id": "19058",
        "name": "طاية"
      },
      {
        "id": "19059",
        "name": "الولجـة"
      },
      {
        "id": "19060",
        "name": "التلة"
      }
    ]
  },
  {
    "id": "20",
    "code": 20,
    "name": "سعيدة",
    "communes": [
      {
        "id": "20001",
        "name": "سعيدة"
      },
      {
        "id": "20002",
        "name": "دوى ثابت"
      },
      {
        "id": "20003",
        "name": "عين الحجر"
      },
      {
        "id": "20004",
        "name": "أولاد خالد"
      },
      {
        "id": "20005",
        "name": "موالي العربي"
      },
      {
        "id": "20006",
        "name": "يوب"
      },
      {
        "id": "20007",
        "name": "هونت"
      },
      {
        "id": "20008",
        "name": "يدي عمر"
      },
      {
        "id": "20009",
        "name": "سيدي بوبكر"
      },
      {
        "id": "20010",
        "name": "حساسنة"
      },
      {
        "id": "20011",
        "name": "معمورة"
      },
      {
        "id": "20012",
        "name": "سيدي أحمد"
      },
      {
        "id": "20013",
        "name": "العين السخونة"
      },
      {
        "id": "20014",
        "name": "أولاد ابراھيم"
      },
      {
        "id": "20015",
        "name": "تيرسين"
      },
      {
        "id": "20016",
        "name": "عين السلطان"
      }
    ]
  },
  {
    "id": "21",
    "code": 21,
    "name": "سكيكدة",
    "communes": [
      {
        "id": "21001",
        "name": "سكيكدة"
      },
      {
        "id": "21002",
        "name": "عين زويت"
      },
      {
        "id": "21003",
        "name": "الحدايق"
      },
      {
        "id": "21004",
        "name": "عزابة"
      },
      {
        "id": "21005",
        "name": "جندل"
      },
      {
        "id": "21006",
        "name": "عين شرشار"
      },
      {
        "id": "21007",
        "name": "بكوش لخضر"
      },
      {
        "id": "21008",
        "name": "بن عزوز"
      },
      {
        "id": "21009",
        "name": "السبت"
      },
      {
        "id": "21010",
        "name": "القل"
      },
      {
        "id": "21011",
        "name": "بنى زيد"
      },
      {
        "id": "21012",
        "name": "كركرة"
      },
      {
        "id": "21013",
        "name": "أولاد عطية"
      },
      {
        "id": "21014",
        "name": "وادي الزهور"
      },
      {
        "id": "21015",
        "name": "الزيتونة"
      },
      {
        "id": "21016",
        "name": "الحروش"
      },
      {
        "id": "21017",
        "name": "زردازة"
      },
      {
        "id": "21018",
        "name": "أولاد حبابة"
      },
      {
        "id": "21019",
        "name": "سيدي مزغيش"
      },
      {
        "id": "21020",
        "name": "مجاز الدشيش"
      },
      {
        "id": "21021",
        "name": "بني والبان"
      },
      {
        "id": "21022",
        "name": "عين بوزيان"
      },
      {
        "id": "21023",
        "name": "رمضان جمال"
      },
      {
        "id": "21024",
        "name": "بني بشير"
      },
      {
        "id": "21025",
        "name": "صالح بوالشعور"
      },
      {
        "id": "21026",
        "name": "تمالوس"
      },
      {
        "id": "21027",
        "name": "عين قشرة"
      },
      {
        "id": "21028",
        "name": "أم الطوب"
      },
      {
        "id": "21029",
        "name": "بين الويدان"
      },
      {
        "id": "21030",
        "name": "فلفلة"
      },
      {
        "id": "21031",
        "name": "الشرايع"
      },
      {
        "id": "21032",
        "name": "قنواع"
      },
      {
        "id": "21033",
        "name": "الغدير"
      },
      {
        "id": "21034",
        "name": "بوشطاطة"
      },
      {
        "id": "21035",
        "name": "الولجة بو البلوط"
      },
      {
        "id": "21036",
        "name": "خنق مايوم"
      },
      {
        "id": "21037",
        "name": "حمادي كرومة"
      },
      {
        "id": "21038",
        "name": "المرسى"
      }
    ]
  },
  {
    "id": "22",
    "code": 22,
    "name": "سيدي بلعباس",
    "communes": [
      {
        "id": "22001",
        "name": "سيدي بلعباس"
      },
      {
        "id": "22002",
        "name": "تسالة"
      },
      {
        "id": "22003",
        "name": "سيدي ابراهيم"
      },
      {
        "id": "22004",
        "name": "مصطفى بن ابراهيم"
      },
      {
        "id": "22005",
        "name": "تلاغ"
      },
      {
        "id": "22006",
        "name": "مزاورو"
      },
      {
        "id": "22007",
        "name": "بوخنفيس"
      },
      {
        "id": "22008",
        "name": "سيدي علي بوسيدي"
      },
      {
        "id": "22009",
        "name": "بدر الدين المقراني"
      },
      {
        "id": "22010",
        "name": "مرحوم"
      },
      {
        "id": "22011",
        "name": "تفسور"
      },
      {
        "id": "22012",
        "name": "العمارنة"
      },
      {
        "id": "22013",
        "name": "تلموني"
      },
      {
        "id": "22014",
        "name": "سيدي لحسن"
      },
      {
        "id": "22015",
        "name": "عين التريد"
      },
      {
        "id": "22016",
        "name": "مكدرة"
      },
      {
        "id": "22017",
        "name": "تنيرة"
      },
      {
        "id": "22018",
        "name": "مولاي سليسن"
      },
      {
        "id": "22019",
        "name": "الحصيبة"
      },
      {
        "id": "22020",
        "name": "حاسي زهانة"
      },
      {
        "id": "22021",
        "name": "طابية"
      },
      {
        "id": "22022",
        "name": "مرين"
      },
      {
        "id": "22023",
        "name": "رأس الماء"
      },
      {
        "id": "22024",
        "name": "عين تندامين"
      },
      {
        "id": "22025",
        "name": "عين قادة"
      },
      {
        "id": "22026",
        "name": "مسيد"
      },
      {
        "id": "22027",
        "name": "سيدي خالد"
      },
      {
        "id": "22028",
        "name": "عين البرد"
      },
      {
        "id": "22029",
        "name": "سفيزف"
      },
      {
        "id": "22030",
        "name": "عين عدان"
      },
      {
        "id": "22031",
        "name": "واد تاوريرة"
      },
      {
        "id": "22032",
        "name": "الظاية"
      },
      {
        "id": "22033",
        "name": "زروالة"
      },
      {
        "id": "22034",
        "name": "لمطار"
      },
      {
        "id": "22035",
        "name": "سيدي شعيب"
      },
      {
        "id": "22036",
        "name": "سيدي دحو"
      },
      {
        "id": "22037",
        "name": "واد السبع"
      },
      {
        "id": "22038",
        "name": "بوجبهة البرج"
      },
      {
        "id": "22039",
        "name": "سهالة الثورة"
      },
      {
        "id": "22040",
        "name": "سيدي يعقوب"
      },
      {
        "id": "22041",
        "name": "سيدي حمادوش"
      },
      {
        "id": "22042",
        "name": "بلعربي"
      },
      {
        "id": "22043",
        "name": "واد سفيون"
      },
      {
        "id": "22044",
        "name": "تغاليمت"
      },
      {
        "id": "22045",
        "name": "ابن باديس"
      },
      {
        "id": "22046",
        "name": "سيدي علي بن يوب"
      },
      {
        "id": "22047",
        "name": "شطوان بلايلة"
      },
      {
        "id": "22048",
        "name": "بئر الحمام"
      },
      {
        "id": "22049",
        "name": "تاودموت"
      },
      {
        "id": "22050",
        "name": "رجم دموش"
      },
      {
        "id": "22051",
        "name": "بن عشيبة شلية"
      },
      {
        "id": "22052",
        "name": "حاسي دحو"
      }
    ]
  },
  {
    "id": "23",
    "code": 23,
    "name": "عنابة",
    "communes": [
      {
        "id": "23001",
        "name": "عنابة"
      },
      {
        "id": "23002",
        "name": "برحال"
      },
      {
        "id": "23003",
        "name": "الحجار"
      },
      {
        "id": "23004",
        "name": "العلمة"
      },
      {
        "id": "23005",
        "name": "البوني"
      },
      {
        "id": "23006",
        "name": "وادي العنب"
      },
      {
        "id": "23007",
        "name": "الشرفة"
      },
      {
        "id": "23008",
        "name": "سرايدي"
      },
      {
        "id": "23009",
        "name": "عين الباردة"
      },
      {
        "id": "23010",
        "name": "شطايبي"
      },
      {
        "id": "23011",
        "name": "سيدي عمار"
      },
      {
        "id": "23012",
        "name": "التريعات"
      }
    ]
  },
  {
    "id": "24",
    "code": 24,
    "name": "قالمة",
    "communes": [
      {
        "id": "24001",
        "name": "قالمة"
      },
      {
        "id": "24002",
        "name": "نشماية"
      },
      {
        "id": "24003",
        "name": "بوعاتي محمود"
      },
      {
        "id": "24004",
        "name": "وادي الزناتي"
      },
      {
        "id": "24005",
        "name": "تاملوكة"
      },
      {
        "id": "24006",
        "name": "وادي فراغة"
      },
      {
        "id": "24007",
        "name": "عين صندل"
      },
      {
        "id": "24008",
        "name": "راس العقبة"
      },
      {
        "id": "24009",
        "name": "الدهوارة"
      },
      {
        "id": "24010",
        "name": "بلخير"
      },
      {
        "id": "24011",
        "name": "بن جراح"
      },
      {
        "id": "24012",
        "name": "بوحمدان"
      },
      {
        "id": "24013",
        "name": "عين مخلوف"
      },
      {
        "id": "24014",
        "name": "عين بن بيضاء"
      },
      {
        "id": "24015",
        "name": "خزارة"
      },
      {
        "id": "24016",
        "name": "بني مزلين"
      },
      {
        "id": "24017",
        "name": "بوحشانة"
      },
      {
        "id": "24018",
        "name": "قلعة بوصبع"
      },
      {
        "id": "24019",
        "name": "حمام مسخوطين"
      },
      {
        "id": "24020",
        "name": "الفجوج"
      },
      {
        "id": "24021",
        "name": "برج صباط"
      },
      {
        "id": "24022",
        "name": "حمام النبايل"
      },
      {
        "id": "24023",
        "name": "عين العربى"
      },
      {
        "id": "24024",
        "name": "مجاز عمار"
      },
      {
        "id": "24025",
        "name": "بوشقوف"
      },
      {
        "id": "24026",
        "name": "ھيليوبوليس"
      },
      {
        "id": "24027",
        "name": "هواري بومدين"
      },
      {
        "id": "24028",
        "name": "الركنية"
      },
      {
        "id": "24029",
        "name": "سلاوة عنونة"
      },
      {
        "id": "24030",
        "name": "مجاز الصفاء"
      },
      {
        "id": "24031",
        "name": "بومهرة أحمد"
      },
      {
        "id": "24032",
        "name": "عين رقادة"
      },
      {
        "id": "24033",
        "name": "وادي الشحم"
      },
      {
        "id": "24034",
        "name": "جبالة لخميسي"
      }
    ]
  },
  {
    "id": "25",
    "code": 25,
    "name": "قسنطينة",
    "communes": [
      {
        "id": "25001",
        "name": "قسنطينة"
      },
      {
        "id": "25002",
        "name": "حامة بوزيان"
      },
      {
        "id": "25003",
        "name": "إبن باديس"
      },
      {
        "id": "25004",
        "name": "زيغود يوسف"
      },
      {
        "id": "25005",
        "name": "ديدوش مراد"
      },
      {
        "id": "25006",
        "name": "الخروب"
      },
      {
        "id": "25007",
        "name": "عين عبيد"
      },
      {
        "id": "25008",
        "name": "بني حميدان"
      },
      {
        "id": "25009",
        "name": "أولاد رحمون"
      },
      {
        "id": "25010",
        "name": "عين سمارة"
      },
      {
        "id": "25011",
        "name": "مسعود بوجريو"
      },
      {
        "id": "25012",
        "name": "ابن زياد"
      }
    ]
  },
  {
    "id": "26",
    "code": 26,
    "name": "المدية",
    "communes": [
      {
        "id": "26001",
        "name": "المدية"
      },
      {
        "id": "26002",
        "name": "وزرة"
      },
      {
        "id": "26003",
        "name": "أولاد معرف"
      },
      {
        "id": "26004",
        "name": "عين بوسيف"
      },
      {
        "id": "26005",
        "name": "العيساوية"
      },
      {
        "id": "26006",
        "name": "أولاد دايد"
      },
      {
        "id": "26008",
        "name": "دراڨ"
      },
      {
        "id": "26009",
        "name": "القلب الكبير"
      },
      {
        "id": "26010",
        "name": "بوعيش"
      },
      {
        "id": "26011",
        "name": "مزغنة"
      },
      {
        "id": "26012",
        "name": "أولاد إبراهيم"
      },
      {
        "id": "26013",
        "name": "تيزي المهدي"
      },
      {
        "id": "26014",
        "name": "سيدي زيان"
      },
      {
        "id": "26015",
        "name": "تمزڨيدة"
      },
      {
        "id": "26016",
        "name": "الحمدانية"
      },
      {
        "id": "26017",
        "name": "الكاف الأخضر"
      },
      {
        "id": "26018",
        "name": "شلالة العذاورة"
      },
      {
        "id": "26019",
        "name": "بوسكن"
      },
      {
        "id": "26020",
        "name": "الربعية"
      },
      {
        "id": "26021",
        "name": "بوشراحيل"
      },
      {
        "id": "26022",
        "name": "أولاد هلال"
      },
      {
        "id": "26023",
        "name": "تافراوت"
      },
      {
        "id": "26024",
        "name": "بعطة"
      },
      {
        "id": "26025",
        "name": "بوغار"
      },
      {
        "id": "26026",
        "name": "سيدي نعمان"
      },
      {
        "id": "26027",
        "name": "أولاد بوعشرة"
      },
      {
        "id": "26028",
        "name": "سيدي زهار"
      },
      {
        "id": "26029",
        "name": "وادي حربيل"
      },
      {
        "id": "26030",
        "name": "بن شكاو"
      },
      {
        "id": "26031",
        "name": "سيدي دامد"
      },
      {
        "id": "26033",
        "name": "السواڨي"
      },
      {
        "id": "26034",
        "name": "الزبيرية"
      },
      {
        "id": "26036",
        "name": "العزيزية"
      },
      {
        "id": "26037",
        "name": "جواب"
      },
      {
        "id": "26039",
        "name": "مغراوة"
      },
      {
        "id": "26040",
        "name": "شنيڨل"
      },
      {
        "id": "26041",
        "name": "عين القصير"
      },
      {
        "id": "26042",
        "name": "أم الجليل"
      },
      {
        "id": "26043",
        "name": "عوامري"
      },
      {
        "id": "26044",
        "name": "سى المحجوب"
      },
      {
        "id": "26045",
        "name": "ثلاثة الدوائر"
      },
      {
        "id": "26046",
        "name": "بني سليمان"
      },
      {
        "id": "26047",
        "name": "البرواڨية"
      },
      {
        "id": "26048",
        "name": "سغوان"
      },
      {
        "id": "26049",
        "name": "المفاتحة"
      },
      {
        "id": "26050",
        "name": "ميهوب"
      },
      {
        "id": "26051",
        "name": "بوغزول"
      },
      {
        "id": "26052",
        "name": "تابلاط"
      },
      {
        "id": "26053",
        "name": "فج الحوضين"
      },
      {
        "id": "26054",
        "name": "ذراع السمار"
      },
      {
        "id": "26055",
        "name": "سيدي الربيع"
      },
      {
        "id": "26056",
        "name": "بئر بن العابد"
      },
      {
        "id": "26057",
        "name": "العوينات"
      },
      {
        "id": "26059",
        "name": "بوعيشون"
      },
      {
        "id": "26060",
        "name": "حناشة"
      },
      {
        "id": "26061",
        "name": "سدراية"
      },
      {
        "id": "26062",
        "name": "مجبر"
      },
      {
        "id": "26063",
        "name": "خمس جوامع"
      }
    ]
  },
  {
    "id": "27",
    "code": 27,
    "name": "مستغانم",
    "communes": [
      {
        "id": "27001",
        "name": "مستغانم"
      },
      {
        "id": "27002",
        "name": "صيادة"
      },
      {
        "id": "27003",
        "name": "فرناكة"
      },
      {
        "id": "27004",
        "name": "ستيدية"
      },
      {
        "id": "27005",
        "name": "عين نويسي"
      },
      {
        "id": "27006",
        "name": "حاسي مماش"
      },
      {
        "id": "27007",
        "name": "عين تادلس"
      },
      {
        "id": "27008",
        "name": "صور"
      },
      {
        "id": "27009",
        "name": "واد الخير"
      },
      {
        "id": "27010",
        "name": "سيدي بلعاتر"
      },
      {
        "id": "27011",
        "name": "خير الدين"
      },
      {
        "id": "27012",
        "name": "سيدي علي"
      },
      {
        "id": "27013",
        "name": "عبد المالك رمضان"
      },
      {
        "id": "27014",
        "name": "حجاج"
      },
      {
        "id": "27015",
        "name": "نقمارية"
      },
      {
        "id": "27016",
        "name": "سيدي لخضر"
      },
      {
        "id": "27017",
        "name": "عشعاشة"
      },
      {
        "id": "27018",
        "name": "خضراء"
      },
      {
        "id": "27019",
        "name": "بوقيراط"
      },
      {
        "id": "27020",
        "name": "سيرات"
      },
      {
        "id": "27021",
        "name": "عين سيدي شريف"
      },
      {
        "id": "27022",
        "name": "ماسرة"
      },
      {
        "id": "27023",
        "name": "منصورة"
      },
      {
        "id": "27024",
        "name": "سوافلية"
      },
      {
        "id": "27025",
        "name": "أوالد بوغالم"
      },
      {
        "id": "27026",
        "name": "أولاد مع اللّه"
      },
      {
        "id": "27027",
        "name": "مزغران"
      },
      {
        "id": "27028",
        "name": "عين بودينار"
      },
      {
        "id": "27029",
        "name": "تزقايت"
      },
      {
        "id": "27030",
        "name": "صفصاف"
      },
      {
        "id": "27031",
        "name": "طواھيرية"
      },
      {
        "id": "27032",
        "name": "الحسيان"
      }
    ]
  },
  {
    "id": "28",
    "code": 28,
    "name": "المسيلة",
    "communes": [
      {
        "id": "28001",
        "name": "المسيلة"
      },
      {
        "id": "28002",
        "name": "المعاضيد"
      },
      {
        "id": "28004",
        "name": "أولاد دراج"
      },
      {
        "id": "28005",
        "name": "تارمونت"
      },
      {
        "id": "28006",
        "name": "مطارفة"
      },
      {
        "id": "28007",
        "name": "خبانة"
      },
      {
        "id": "28008",
        "name": "مسيف"
      },
      {
        "id": "28009",
        "name": "شلال"
      },
      {
        "id": "28012",
        "name": "برهوم"
      },
      {
        "id": "28013",
        "name": "عين الخضراء"
      },
      {
        "id": "28014",
        "name": "اولاد عدي لقبالة"
      },
      {
        "id": "28016",
        "name": "سيدي عيسى"
      },
      {
        "id": "28018",
        "name": "سيدي ھجرس"
      },
      {
        "id": "28019",
        "name": "ونوغة"
      },
      {
        "id": "28025",
        "name": "أولاد سليمان"
      },
      {
        "id": "28026",
        "name": "الحوامد"
      },
      {
        "id": "28027",
        "name": "الهامل"
      },
      {
        "id": "28028",
        "name": "أولاد منصور"
      },
      {
        "id": "28033",
        "name": "الزرزور"
      },
      {
        "id": "28034",
        "name": "محمد بوضياف"
      },
      {
        "id": "28035",
        "name": "بن الزوه"
      },
      {
        "id": "28036",
        "name": "بير الفضة"
      },
      {
        "id": "28037",
        "name": "عين فارس"
      },
      {
        "id": "28038",
        "name": "سيدي محمد"
      },
      {
        "id": "28039",
        "name": "منعة"
      },
      {
        "id": "28040",
        "name": "الصوامع"
      },
      {
        "id": "28042",
        "name": "مجدل"
      },
      {
        "id": "28045",
        "name": "بنى يلمان"
      },
      {
        "id": "28046",
        "name": "ولتام"
      }
    ]
  },
  {
    "id": "29",
    "code": 29,
    "name": "معسكر",
    "communes": [
      {
        "id": "29001",
        "name": "مـعـسـكـر"
      },
      {
        "id": "29002",
        "name": "بوحنيفية"
      },
      {
        "id": "29003",
        "name": "تيزي"
      },
      {
        "id": "29004",
        "name": "حسين"
      },
      {
        "id": "29005",
        "name": "ماوسة"
      },
      {
        "id": "29006",
        "name": "تيغنيف"
      },
      {
        "id": "29007",
        "name": "الهاشم"
      },
      {
        "id": "29008",
        "name": "سيدي قادة"
      },
      {
        "id": "29009",
        "name": "زلماطة"
      },
      {
        "id": "29010",
        "name": "واد الأبطال"
      },
      {
        "id": "29011",
        "name": "عين فراح"
      },
      {
        "id": "29012",
        "name": "غريس"
      },
      {
        "id": "29013",
        "name": "فروحة"
      },
      {
        "id": "29014",
        "name": "مطمور"
      },
      {
        "id": "29015",
        "name": "ماقضة"
      },
      {
        "id": "29016",
        "name": "سيدي بوسعيد"
      },
      {
        "id": "29017",
        "name": "البرج"
      },
      {
        "id": "29018",
        "name": "عين فكان"
      },
      {
        "id": "29019",
        "name": "بنيان"
      },
      {
        "id": "29020",
        "name": "خلوية"
      },
      {
        "id": "29021",
        "name": "المناور"
      },
      {
        "id": "29022",
        "name": "واد التاغية"
      },
      {
        "id": "29023",
        "name": "عوف"
      },
      {
        "id": "29024",
        "name": "عين فارس"
      },
      {
        "id": "29025",
        "name": "عين فراس"
      },
      {
        "id": "29026",
        "name": "سيڨ"
      },
      {
        "id": "29027",
        "name": "عقاز"
      },
      {
        "id": "29028",
        "name": "العلايمية"
      },
      {
        "id": "29029",
        "name": "القعدة"
      },
      {
        "id": "29030",
        "name": "زھانة"
      },
      {
        "id": "29031",
        "name": "المحمدية"
      },
      {
        "id": "29032",
        "name": "سيدي عبد المومن"
      },
      {
        "id": "29033",
        "name": "فرقيق"
      },
      {
        "id": "29034",
        "name": "الغمري"
      },
      {
        "id": "29035",
        "name": "سجرارة"
      },
      {
        "id": "29036",
        "name": "مقطع الدوز"
      },
      {
        "id": "29037",
        "name": "بوهني"
      },
      {
        "id": "29038",
        "name": "القيطنة"
      },
      {
        "id": "29039",
        "name": "المامونية"
      },
      {
        "id": "29040",
        "name": "الكرط"
      },
      {
        "id": "29041",
        "name": "غروس"
      },
      {
        "id": "29042",
        "name": "ڤرجوم"
      },
      {
        "id": "29043",
        "name": "الشرفة"
      },
      {
        "id": "29044",
        "name": "رأس العين عميروش"
      },
      {
        "id": "29045",
        "name": "نسموط"
      },
      {
        "id": "29046",
        "name": "سيدي عبد الجبار"
      },
      {
        "id": "29047",
        "name": "سحايلية"
      }
    ]
  },
  {
    "id": "30",
    "code": 30,
    "name": "ورقلة",
    "communes": [
      {
        "id": "30001",
        "name": "ورڨلة"
      },
      {
        "id": "30002",
        "name": "عين البيضاء"
      },
      {
        "id": "30003",
        "name": "نقوسة"
      },
      {
        "id": "30004",
        "name": "حاسي مسعود"
      },
      {
        "id": "30005",
        "name": "الرويسات"
      },
      {
        "id": "30006",
        "name": "بليدة عامر"
      },
      {
        "id": "30011",
        "name": "سيدي خويلد"
      },
      {
        "id": "30012",
        "name": "حاسي بن عبد ﷲ"
      },
      {
        "id": "30021",
        "name": "البرمة"
      }
    ]
  },
  {
    "id": "31",
    "code": 31,
    "name": "وهران",
    "communes": [
      {
        "id": "31001",
        "name": "وهران"
      },
      {
        "id": "31002",
        "name": "ڨديل"
      },
      {
        "id": "31003",
        "name": "بئر الجير"
      },
      {
        "id": "31004",
        "name": "حاسيْ بُونِيف"
      },
      {
        "id": "31005",
        "name": "السانية"
      },
      {
        "id": "31006",
        "name": "أرزيو"
      },
      {
        "id": "31007",
        "name": "ﺑﻃﻴﻭة"
      },
      {
        "id": "31008",
        "name": "مَرس ألحَجَاج"
      },
      {
        "id": "31009",
        "name": "عيْن التُرْكْ"
      },
      {
        "id": "31010",
        "name": "العنصر"
      },
      {
        "id": "31011",
        "name": "وادى تليلات"
      },
      {
        "id": "31012",
        "name": "طفراوي"
      },
      {
        "id": "31013",
        "name": "سيدي الشحمي"
      },
      {
        "id": "31014",
        "name": "بوفاطيس"
      },
      {
        "id": "31015",
        "name": "المرسى الكبير"
      },
      {
        "id": "31016",
        "name": "بوسفر"
      },
      {
        "id": "31017",
        "name": "الكرمة"
      },
      {
        "id": "31018",
        "name": "ألبْرَيَ"
      },
      {
        "id": "31019",
        "name": "حاسي بن عقبة"
      },
      {
        "id": "31020",
        "name": "بن فريحة"
      },
      {
        "id": "31021",
        "name": "حاسي مفسوخ"
      },
      {
        "id": "31022",
        "name": "سيدي بن يبقى"
      },
      {
        "id": "31023",
        "name": "مسرغين"
      },
      {
        "id": "31024",
        "name": "بوتليليس"
      },
      {
        "id": "31025",
        "name": "عين الكرمة"
      },
      {
        "id": "31026",
        "name": "عين البية"
      }
    ]
  },
  {
    "id": "32",
    "code": 32,
    "name": "البيض",
    "communes": [
      {
        "id": "32001",
        "name": "الـبـيـض"
      },
      {
        "id": "32002",
        "name": "روقاصة"
      },
      {
        "id": "32003",
        "name": "ستيتين"
      },
      {
        "id": "32004",
        "name": "بريزينة"
      },
      {
        "id": "32005",
        "name": "غسول"
      },
      {
        "id": "32006",
        "name": "بوعلام"
      },
      {
        "id": "32010",
        "name": "بوقطب"
      },
      {
        "id": "32011",
        "name": "الخيثر"
      },
      {
        "id": "32012",
        "name": "الكاف الاحمر"
      },
      {
        "id": "32015",
        "name": "كراكدة"
      },
      {
        "id": "32016",
        "name": "البنود"
      },
      {
        "id": "32017",
        "name": "الشقيق"
      },
      {
        "id": "32018",
        "name": "سيدي عامر"
      },
      {
        "id": "32020",
        "name": "توسمولين"
      },
      {
        "id": "32021",
        "name": "سيدي سليمان"
      },
      {
        "id": "32022",
        "name": "سيدي طيفور"
      }
    ]
  },
  {
    "id": "33",
    "code": 33,
    "name": "إليزي",
    "communes": [
      {
        "id": "33001",
        "name": "إلـيـزي"
      },
      {
        "id": "33003",
        "name": "دبداب"
      },
      {
        "id": "33004",
        "name": "برج عمر ادريس"
      },
      {
        "id": "33006",
        "name": "إن أميناس"
      }
    ]
  },
  {
    "id": "34",
    "code": 34,
    "name": "برج بوعريريج",
    "communes": [
      {
        "id": "34001",
        "name": "برج بوعريريج"
      },
      {
        "id": "34002",
        "name": "رأس الوادي"
      },
      {
        "id": "34003",
        "name": "برج زمورة"
      },
      {
        "id": "34004",
        "name": "منصورة"
      },
      {
        "id": "34005",
        "name": "المھير"
      },
      {
        "id": "34006",
        "name": "بن داود"
      },
      {
        "id": "34007",
        "name": "العشير"
      },
      {
        "id": "34008",
        "name": "عين تاغروت"
      },
      {
        "id": "34009",
        "name": "برج غدير"
      },
      {
        "id": "34010",
        "name": "سيدي مبارك"
      },
      {
        "id": "34011",
        "name": "الحمادية"
      },
      {
        "id": "34012",
        "name": "بليمور"
      },
      {
        "id": "34013",
        "name": "مجانة"
      },
      {
        "id": "34014",
        "name": "ثنية النصر"
      },
      {
        "id": "34015",
        "name": "جعافرة"
      },
      {
        "id": "34016",
        "name": "إلماين"
      },
      {
        "id": "34017",
        "name": "أولاد ابراھم"
      },
      {
        "id": "34018",
        "name": "أولاد دحمان"
      },
      {
        "id": "34019",
        "name": "حسناوة"
      },
      {
        "id": "34020",
        "name": "خليل"
      },
      {
        "id": "34021",
        "name": "تاقلعيت"
      },
      {
        "id": "34022",
        "name": "القصور"
      },
      {
        "id": "34023",
        "name": "آث سيذى پراهم."
      },
      {
        "id": "34024",
        "name": "تفرڨ"
      },
      {
        "id": "34025",
        "name": "القلة"
      },
      {
        "id": "34026",
        "name": "تقصطر"
      },
      {
        "id": "34027",
        "name": "العش"
      },
      {
        "id": "34028",
        "name": "العناصر"
      },
      {
        "id": "34029",
        "name": "تسمارت"
      },
      {
        "id": "34030",
        "name": "عين تسرة"
      },
      {
        "id": "34031",
        "name": "بئر قصد علي"
      },
      {
        "id": "34032",
        "name": "غيلاسة"
      },
      {
        "id": "34033",
        "name": "الرابطة"
      },
      {
        "id": "34034",
        "name": "الحرازة"
      }
    ]
  },
  {
    "id": "35",
    "code": 35,
    "name": "بومرداس",
    "communes": [
      {
        "id": "35001",
        "name": "بومرداس"
      },
      {
        "id": "35002",
        "name": "بودواو"
      },
      {
        "id": "35004",
        "name": "أفير"
      },
      {
        "id": "35005",
        "name": "برج منايل"
      },
      {
        "id": "35006",
        "name": "بغلية"
      },
      {
        "id": "35007",
        "name": "سيدي داود"
      },
      {
        "id": "35008",
        "name": "الناصرية"
      },
      {
        "id": "35009",
        "name": "جنات"
      },
      {
        "id": "35010",
        "name": "يسر"
      },
      {
        "id": "35011",
        "name": "زموري"
      },
      {
        "id": "35012",
        "name": "سي مصطفى"
      },
      {
        "id": "35013",
        "name": "تيجلابين"
      },
      {
        "id": "35014",
        "name": "شعبة العامر"
      },
      {
        "id": "35015",
        "name": "الثنية"
      },
      {
        "id": "35018",
        "name": "تمزريت"
      },
      {
        "id": "35019",
        "name": "قورصو"
      },
      {
        "id": "35020",
        "name": "أولاد موسى"
      },
      {
        "id": "35021",
        "name": "الأربعطاش"
      },
      {
        "id": "35022",
        "name": "بوزقزة قدارة"
      },
      {
        "id": "35025",
        "name": "تورقة"
      },
      {
        "id": "35026",
        "name": "أولاد عيسى"
      },
      {
        "id": "35027",
        "name": "بن شود"
      },
      {
        "id": "35028",
        "name": "دلس"
      },
      {
        "id": "35029",
        "name": "عمال"
      },
      {
        "id": "35030",
        "name": "بنى عمران"
      },
      {
        "id": "35031",
        "name": "سوق الحد"
      },
      {
        "id": "35032",
        "name": "بودواو البحرى"
      },
      {
        "id": "35033",
        "name": "أولاد ھداج"
      },
      {
        "id": "35035",
        "name": "لقاطة"
      },
      {
        "id": "35036",
        "name": "حمادى"
      },
      {
        "id": "35037",
        "name": "خميس الخشنة"
      },
      {
        "id": "35038",
        "name": "الخروبة"
      }
    ]
  },
  {
    "id": "36",
    "code": 36,
    "name": "الطارف",
    "communes": [
      {
        "id": "36001",
        "name": "الطارف"
      },
      {
        "id": "36002",
        "name": "بوحجار"
      },
      {
        "id": "36003",
        "name": "بن مهيدى"
      },
      {
        "id": "36004",
        "name": "بوقوس"
      },
      {
        "id": "36005",
        "name": "القالة"
      },
      {
        "id": "36006",
        "name": "عين العسل"
      },
      {
        "id": "36007",
        "name": "العيون"
      },
      {
        "id": "36008",
        "name": "بوثلجة"
      },
      {
        "id": "36009",
        "name": "السوارخ"
      },
      {
        "id": "36010",
        "name": "برحان"
      },
      {
        "id": "36011",
        "name": "بحيرة الطيور"
      },
      {
        "id": "36012",
        "name": "الشافية"
      },
      {
        "id": "36013",
        "name": "الذرعان"
      },
      {
        "id": "36014",
        "name": "شهانى"
      },
      {
        "id": "36015",
        "name": "شبيطة مختار"
      },
      {
        "id": "36016",
        "name": "البسباس"
      },
      {
        "id": "36017",
        "name": "عصفور"
      },
      {
        "id": "36018",
        "name": "الشط"
      },
      {
        "id": "36019",
        "name": "زريزر"
      },
      {
        "id": "36020",
        "name": "الزيتونة"
      },
      {
        "id": "36021",
        "name": "عين الكرمة"
      },
      {
        "id": "36022",
        "name": "وادى الزيتون"
      },
      {
        "id": "36023",
        "name": "حمام بنى صالح"
      },
      {
        "id": "36024",
        "name": "رمل سوق"
      }
    ]
  },
  {
    "id": "37",
    "code": 37,
    "name": "تندوف",
    "communes": [
      {
        "id": "37001",
        "name": "تندوف"
      },
      {
        "id": "37002",
        "name": "أم العسل"
      }
    ]
  },
  {
    "id": "38",
    "code": 38,
    "name": "تيسمسيلت",
    "communes": [
      {
        "id": "38001",
        "name": "تـيـسـمـسـيـلـت"
      },
      {
        "id": "38002",
        "name": "برج بونعامة"
      },
      {
        "id": "38003",
        "name": "ثنية الاحد"
      },
      {
        "id": "38004",
        "name": "الازھرية"
      },
      {
        "id": "38005",
        "name": "بنى شعيب"
      },
      {
        "id": "38006",
        "name": "لارجم"
      },
      {
        "id": "38007",
        "name": "ملعب"
      },
      {
        "id": "38008",
        "name": "سيدي العنترى"
      },
      {
        "id": "38009",
        "name": "برج الامير عبد القادر"
      },
      {
        "id": "38010",
        "name": "العيون"
      },
      {
        "id": "38011",
        "name": "خميستى"
      },
      {
        "id": "38012",
        "name": "أولاد بسام"
      },
      {
        "id": "38013",
        "name": "عمارى"
      },
      {
        "id": "38014",
        "name": "اليوسفية"
      },
      {
        "id": "38015",
        "name": "سيدي بوتوشنت"
      },
      {
        "id": "38016",
        "name": "الاربعاء"
      },
      {
        "id": "38017",
        "name": "المعاصم"
      },
      {
        "id": "38018",
        "name": "سيدي عابد"
      },
      {
        "id": "38019",
        "name": "تاملاحت"
      },
      {
        "id": "38020",
        "name": "سيدي سليمان"
      },
      {
        "id": "38021",
        "name": "بوقايد"
      },
      {
        "id": "38022",
        "name": "بنى لحسن"
      }
    ]
  },
  {
    "id": "39",
    "code": 39,
    "name": "الوادي",
    "communes": [
      {
        "id": "39001",
        "name": "الوادي"
      },
      {
        "id": "39002",
        "name": "رباح"
      },
      {
        "id": "39003",
        "name": "وادى العلندة"
      },
      {
        "id": "39004",
        "name": "البياضة"
      },
      {
        "id": "39005",
        "name": "النخلة"
      },
      {
        "id": "39006",
        "name": "ڨمار"
      },
      {
        "id": "39007",
        "name": "كوينين"
      },
      {
        "id": "39008",
        "name": "الرڨيبة"
      },
      {
        "id": "39009",
        "name": "الحمراية"
      },
      {
        "id": "39010",
        "name": "تغزوت"
      },
      {
        "id": "39011",
        "name": "الدبيلة"
      },
      {
        "id": "39012",
        "name": "بلدية حساني عبد الكريم"
      },
      {
        "id": "39013",
        "name": "حاسى خليفة"
      },
      {
        "id": "39014",
        "name": "طالب العربي"
      },
      {
        "id": "39015",
        "name": "دوار الماء"
      },
      {
        "id": "39016",
        "name": "سيدي عون"
      },
      {
        "id": "39017",
        "name": "تريفاوى"
      },
      {
        "id": "39018",
        "name": "المڨرن"
      },
      {
        "id": "39019",
        "name": "بن ڨشة"
      },
      {
        "id": "39020",
        "name": "أورماس"
      },
      {
        "id": "39022",
        "name": "مرارة"
      },
      {
        "id": "39023",
        "name": "سيدي خليل"
      },
      {
        "id": "39025",
        "name": "العقلة"
      },
      {
        "id": "39026",
        "name": "مية ونسة"
      },
      {
        "id": "39027",
        "name": "المغير"
      }
    ]
  },
  {
    "id": "40",
    "code": 40,
    "name": "خنشلة",
    "communes": [
      {
        "id": "40001",
        "name": "خنشلة"
      },
      {
        "id": "40002",
        "name": "متوسة"
      },
      {
        "id": "40003",
        "name": "قايس"
      },
      {
        "id": "40004",
        "name": "بغاي"
      },
      {
        "id": "40005",
        "name": "الحامة"
      },
      {
        "id": "40006",
        "name": "عين الطويلة"
      },
      {
        "id": "40007",
        "name": "تاوزيانت"
      },
      {
        "id": "40008",
        "name": "بوحمامة"
      },
      {
        "id": "40009",
        "name": "الولجة"
      },
      {
        "id": "40010",
        "name": "الرميلة"
      },
      {
        "id": "40011",
        "name": "ششار"
      },
      {
        "id": "40012",
        "name": "جلال"
      },
      {
        "id": "40013",
        "name": "بابار"
      },
      {
        "id": "40014",
        "name": "تامزة"
      },
      {
        "id": "40015",
        "name": "انسيغة"
      },
      {
        "id": "40016",
        "name": "أولاد رشاش"
      },
      {
        "id": "40017",
        "name": "المحمل"
      },
      {
        "id": "40018",
        "name": "أمصارة"
      },
      {
        "id": "40019",
        "name": "يابوس"
      },
      {
        "id": "40020",
        "name": "خيران"
      },
      {
        "id": "40021",
        "name": "شلية"
      }
    ]
  },
  {
    "id": "41",
    "code": 41,
    "name": "سوق أهراس",
    "communes": [
      {
        "id": "41001",
        "name": "سوق أهراس"
      },
      {
        "id": "41002",
        "name": "سدراتة"
      },
      {
        "id": "41003",
        "name": "الحنانشة"
      },
      {
        "id": "41004",
        "name": "المشروحة"
      },
      {
        "id": "41005",
        "name": "أولاد ادريس"
      },
      {
        "id": "41006",
        "name": "تيفاش"
      },
      {
        "id": "41007",
        "name": "الزعرورية"
      },
      {
        "id": "41008",
        "name": "تاورة"
      },
      {
        "id": "41009",
        "name": "الدريعة"
      },
      {
        "id": "41010",
        "name": "الحدادة"
      },
      {
        "id": "41011",
        "name": "لخضارة"
      },
      {
        "id": "41012",
        "name": "المراهنة"
      },
      {
        "id": "41013",
        "name": "أولاد مؤمن"
      },
      {
        "id": "41014",
        "name": "بئر بوحوش"
      },
      {
        "id": "41015",
        "name": "مداوروش"
      },
      {
        "id": "41016",
        "name": "أم العظائم"
      },
      {
        "id": "41017",
        "name": "عين الزانة"
      },
      {
        "id": "41018",
        "name": "عين السلطان"
      },
      {
        "id": "41019",
        "name": "ويلان"
      },
      {
        "id": "41020",
        "name": "سيدي فرج"
      },
      {
        "id": "41021",
        "name": "سافل الويدان"
      },
      {
        "id": "41022",
        "name": "الرقوبة"
      },
      {
        "id": "41023",
        "name": "خميسة"
      },
      {
        "id": "41024",
        "name": "وادى الكبريت"
      },
      {
        "id": "41025",
        "name": "ترقالت"
      },
      {
        "id": "41026",
        "name": "الزوابى"
      }
    ]
  },
  {
    "id": "42",
    "code": 42,
    "name": "تيبازة",
    "communes": [
      {
        "id": "42001",
        "name": "تيبازة"
      },
      {
        "id": "42002",
        "name": "مناصر"
      },
      {
        "id": "42003",
        "name": "الأرهاط"
      },
      {
        "id": "42004",
        "name": "دواودة"
      },
      {
        "id": "42005",
        "name": "بورقيقة"
      },
      {
        "id": "42006",
        "name": "خميستي"
      },
      {
        "id": "42010",
        "name": "أغابال"
      },
      {
        "id": "42012",
        "name": "حجوط"
      },
      {
        "id": "42013",
        "name": "سيدي عمر"
      },
      {
        "id": "42014",
        "name": "ڨورايا"
      },
      {
        "id": "42015",
        "name": "الناظور"
      },
      {
        "id": "42016",
        "name": "الشعيبة"
      },
      {
        "id": "42017",
        "name": "عين تڨورايت"
      },
      {
        "id": "42022",
        "name": "شرشال"
      },
      {
        "id": "42023",
        "name": "الداموس"
      },
      {
        "id": "42024",
        "name": "مراد"
      },
      {
        "id": "42025",
        "name": "فوكة"
      },
      {
        "id": "42026",
        "name": "بو اسماعيل"
      },
      {
        "id": "42027",
        "name": "أحمر العين"
      },
      {
        "id": "42030",
        "name": "بوهارون"
      },
      {
        "id": "42032",
        "name": "سيدي غيلاس"
      },
      {
        "id": "42033",
        "name": "مسلمون"
      },
      {
        "id": "42034",
        "name": "سيدي راشد"
      },
      {
        "id": "42035",
        "name": "القليعة"
      },
      {
        "id": "42036",
        "name": "الحطاطبة"
      },
      {
        "id": "42040",
        "name": "سيدي سميان"
      },
      {
        "id": "42041",
        "name": "بني ميلك"
      },
      {
        "id": "42042",
        "name": "حجرة النص"
      }
    ]
  },
  {
    "id": "43",
    "code": 43,
    "name": "ميلة",
    "communes": [
      {
        "id": "43001",
        "name": "ميلة"
      },
      {
        "id": "43002",
        "name": "فرجيوة"
      },
      {
        "id": "43003",
        "name": "شلغوم العيد"
      },
      {
        "id": "43004",
        "name": "وادي العثمانية"
      },
      {
        "id": "43005",
        "name": "عين ملوك"
      },
      {
        "id": "43006",
        "name": "تلاغمة"
      },
      {
        "id": "43007",
        "name": "وادى سقان"
      },
      {
        "id": "43008",
        "name": "تاجنانت"
      },
      {
        "id": "43009",
        "name": "بن يحيى عبد الرحمان"
      },
      {
        "id": "43010",
        "name": "وادى النجاء"
      },
      {
        "id": "43011",
        "name": "أحمد راشدي"
      },
      {
        "id": "43012",
        "name": "أولاد خلوف"
      },
      {
        "id": "43013",
        "name": "تيبرقنت"
      },
      {
        "id": "43014",
        "name": "بوحاتم"
      },
      {
        "id": "43015",
        "name": "رواشد"
      },
      {
        "id": "43016",
        "name": "تسالة لمطاي"
      },
      {
        "id": "43017",
        "name": "القرارم قوقة"
      },
      {
        "id": "43018",
        "name": "سيدي مروان"
      },
      {
        "id": "43019",
        "name": "تسدان حدادة"
      },
      {
        "id": "43020",
        "name": "دراحي بوصلاح"
      },
      {
        "id": "43021",
        "name": "مينار زرزة"
      },
      {
        "id": "43022",
        "name": "عميرة أراس"
      },
      {
        "id": "43023",
        "name": "ترعى بينان"
      },
      {
        "id": "43024",
        "name": "حمالة"
      },
      {
        "id": "43025",
        "name": "عين التين"
      },
      {
        "id": "43026",
        "name": "المشيرة"
      },
      {
        "id": "43027",
        "name": "سيدي خليفة"
      },
      {
        "id": "43028",
        "name": "زغاية"
      },
      {
        "id": "43029",
        "name": "العياضى برباس"
      },
      {
        "id": "43030",
        "name": "عين البيضاء حريش"
      },
      {
        "id": "43031",
        "name": "يحيى بنى قشة"
      },
      {
        "id": "43032",
        "name": "الشيقارة"
      }
    ]
  },
  {
    "id": "44",
    "code": 44,
    "name": "عين الدفلى",
    "communes": [
      {
        "id": "44001",
        "name": "عين دفلة - عين الدفلى"
      },
      {
        "id": "44002",
        "name": "مليانة"
      },
      {
        "id": "44003",
        "name": "بومدفع"
      },
      {
        "id": "44004",
        "name": "خميس مليانة"
      },
      {
        "id": "44005",
        "name": "حمام ريغة"
      },
      {
        "id": "44006",
        "name": "عريب"
      },
      {
        "id": "44007",
        "name": "جليدة"
      },
      {
        "id": "44008",
        "name": "العامرة"
      },
      {
        "id": "44009",
        "name": "بوراشد"
      },
      {
        "id": "44010",
        "name": "العطاف"
      },
      {
        "id": "44011",
        "name": "العبادية"
      },
      {
        "id": "44012",
        "name": "جندل"
      },
      {
        "id": "44013",
        "name": "وادى الشرفاء"
      },
      {
        "id": "44014",
        "name": "عين االشياخ"
      },
      {
        "id": "44015",
        "name": "وادى جمعة"
      },
      {
        "id": "44016",
        "name": "روينة"
      },
      {
        "id": "44017",
        "name": "زدين"
      },
      {
        "id": "44018",
        "name": "الحسنية"
      },
      {
        "id": "44019",
        "name": "بئر ولد خليفة"
      },
      {
        "id": "44020",
        "name": "عين السلطان"
      },
      {
        "id": "44021",
        "name": "طارق بن زياد"
      },
      {
        "id": "44022",
        "name": "برج الأمير خالد"
      },
      {
        "id": "44023",
        "name": "عين التركى"
      },
      {
        "id": "44024",
        "name": "سيدي لخضر"
      },
      {
        "id": "44025",
        "name": "بن علال"
      },
      {
        "id": "44026",
        "name": "عين البنيان"
      },
      {
        "id": "44027",
        "name": "حسينية"
      },
      {
        "id": "44028",
        "name": "بربوش"
      },
      {
        "id": "44029",
        "name": "جمعة أولاد الشيخ"
      },
      {
        "id": "44030",
        "name": "المخاطرية"
      },
      {
        "id": "44031",
        "name": "بطحية"
      },
      {
        "id": "44032",
        "name": "تاشتة زقاغة"
      },
      {
        "id": "44033",
        "name": "عين بويحى"
      },
      {
        "id": "44034",
        "name": "الماين"
      },
      {
        "id": "44035",
        "name": "تبركانين"
      },
      {
        "id": "44036",
        "name": "بالعاص"
      }
    ]
  },
  {
    "id": "45",
    "code": 45,
    "name": "النعامة",
    "communes": [
      {
        "id": "45001",
        "name": "النــعـامـة"
      },
      {
        "id": "45002",
        "name": "مشرية"
      },
      {
        "id": "45003",
        "name": "عين الصفراء"
      },
      {
        "id": "45004",
        "name": "تيوت"
      },
      {
        "id": "45005",
        "name": "صفيصيفة"
      },
      {
        "id": "45006",
        "name": "مغرار"
      },
      {
        "id": "45007",
        "name": "عسلة"
      },
      {
        "id": "45008",
        "name": "جنين بورزق"
      },
      {
        "id": "45009",
        "name": "عين بن خليل"
      },
      {
        "id": "45010",
        "name": "مكمن بن عمر"
      },
      {
        "id": "45011",
        "name": "قصدير"
      },
      {
        "id": "45012",
        "name": "البيوض"
      }
    ]
  },
  {
    "id": "46",
    "code": 46,
    "name": "عين تموشنت",
    "communes": [
      {
        "id": "46001",
        "name": "عـيـن تـمـوشـنـت"
      },
      {
        "id": "46002",
        "name": "شعبة اللحم"
      },
      {
        "id": "46003",
        "name": "عين الكيحل"
      },
      {
        "id": "46004",
        "name": "حمام بو حجر"
      },
      {
        "id": "46005",
        "name": "بوزجار"
      },
      {
        "id": "46006",
        "name": "وادى برقش"
      },
      {
        "id": "46007",
        "name": "أغلال"
      },
      {
        "id": "46008",
        "name": "تارقة"
      },
      {
        "id": "46009",
        "name": "عين الاربعاء"
      },
      {
        "id": "46010",
        "name": "تامزوغة"
      },
      {
        "id": "46011",
        "name": "شنتوف"
      },
      {
        "id": "46012",
        "name": "سيدي بن عدة"
      },
      {
        "id": "46013",
        "name": "عقب الليل"
      },
      {
        "id": "46014",
        "name": "المالح"
      },
      {
        "id": "46015",
        "name": "سيدي بومدين"
      },
      {
        "id": "46016",
        "name": "وادى الصباح"
      },
      {
        "id": "46017",
        "name": "أولاد بوجمعة"
      },
      {
        "id": "46018",
        "name": "عين الطلبة"
      },
      {
        "id": "46019",
        "name": "العامرية"
      },
      {
        "id": "46020",
        "name": "حاسى الغلة"
      },
      {
        "id": "46021",
        "name": "الحساسنة"
      },
      {
        "id": "46022",
        "name": "أولاد الكيحل"
      },
      {
        "id": "46023",
        "name": "بني صاف"
      },
      {
        "id": "46024",
        "name": "سيدي الصافي"
      },
      {
        "id": "46025",
        "name": "ولهاصة الغرابة"
      },
      {
        "id": "46026",
        "name": "سيدي وريلش"
      },
      {
        "id": "46027",
        "name": "الأمير عبد القادر"
      },
      {
        "id": "46028",
        "name": "المساعيد"
      }
    ]
  },
  {
    "id": "47",
    "code": 47,
    "name": "غرداية",
    "communes": [
      {
        "id": "47001",
        "name": "غرداية"
      },
      {
        "id": "47002",
        "name": "المنيعة"
      },
      {
        "id": "47003",
        "name": "ضاية بن ضحوة"
      },
      {
        "id": "47004",
        "name": "بريان"
      },
      {
        "id": "47005",
        "name": "متليلي الشعانبة"
      },
      {
        "id": "47006",
        "name": "الڨرارة"
      },
      {
        "id": "47007",
        "name": "العطف"
      },
      {
        "id": "47008",
        "name": "زلفانة"
      },
      {
        "id": "47009",
        "name": "سبسب"
      },
      {
        "id": "47010",
        "name": "بونورة"
      },
      {
        "id": "47013",
        "name": "منصورة"
      }
    ]
  },
  {
    "id": "48",
    "code": 48,
    "name": "غليزان",
    "communes": [
      {
        "id": "48001",
        "name": "غيليزان"
      },
      {
        "id": "48002",
        "name": "وادي رهيو"
      },
      {
        "id": "48003",
        "name": "بلعسل بوزقزة"
      },
      {
        "id": "48004",
        "name": "سيدي سعادة"
      },
      {
        "id": "48005",
        "name": "أولاد يعيش"
      },
      {
        "id": "48006",
        "name": "سيدي لزرق"
      },
      {
        "id": "48007",
        "name": "الحمادنة"
      },
      {
        "id": "48008",
        "name": "سيدي امحمد بن علي"
      },
      {
        "id": "48009",
        "name": "مديونة"
      },
      {
        "id": "48010",
        "name": "سيدي خطاب"
      },
      {
        "id": "48011",
        "name": "عمي موسى"
      },
      {
        "id": "48012",
        "name": "زمورة"
      },
      {
        "id": "48013",
        "name": "بني درقن"
      },
      {
        "id": "48014",
        "name": "جيديوة"
      },
      {
        "id": "48015",
        "name": "القطارة"
      },
      {
        "id": "48016",
        "name": "الحمري"
      },
      {
        "id": "48017",
        "name": "المطمار"
      },
      {
        "id": "48018",
        "name": "سيدي بن عودة"
      },
      {
        "id": "48019",
        "name": "عين طارق"
      },
      {
        "id": "48020",
        "name": "وادي السلام"
      },
      {
        "id": "48021",
        "name": "ﻭﺍﺭﻳﺯﺍﻥ"
      },
      {
        "id": "48022",
        "name": "مازونة"
      },
      {
        "id": "48023",
        "name": "قلعة"
      },
      {
        "id": "48024",
        "name": "عين الرحمة"
      },
      {
        "id": "48025",
        "name": "يلل"
      },
      {
        "id": "48026",
        "name": "وادى الجمعة"
      },
      {
        "id": "48027",
        "name": "رمكة"
      },
      {
        "id": "48028",
        "name": "مندس"
      },
      {
        "id": "48029",
        "name": "لحلاف"
      },
      {
        "id": "48030",
        "name": "بني زنتيس"
      },
      {
        "id": "48031",
        "name": "سوق الحد"
      },
      {
        "id": "48032",
        "name": "دار بن عبد الله"
      },
      {
        "id": "48033",
        "name": "الحاسى"
      },
      {
        "id": "48034",
        "name": "حد الشقالة"
      },
      {
        "id": "48035",
        "name": "بن داود"
      },
      {
        "id": "48036",
        "name": "العلجة"
      },
      {
        "id": "48037",
        "name": "مرجة سيدي عابد"
      },
      {
        "id": "48038",
        "name": "أولاد سيدي ميهوب"
      }
    ]
  },
  {
    "id": "49",
    "code": 49,
    "name": "المغير",
    "communes": [
      {
        "id": "49003",
        "name": "شروين"
      },
      {
        "id": "49007",
        "name": "قصر قدور"
      },
      {
        "id": "49009",
        "name": "تيميمون"
      },
      {
        "id": "49010",
        "name": "أولاد سعيد"
      },
      {
        "id": "49016",
        "name": "زاوية دباغ"
      },
      {
        "id": "49017",
        "name": "دﻟﺪول"
      },
      {
        "id": "49020",
        "name": "المطارفة"
      },
      {
        "id": "49023",
        "name": "أوقروت"
      },
      {
        "id": "49024",
        "name": ""
      },
      {
        "id": "49027",
        "name": "أولاد عيسى"
      },
      {
        "id": "49001",
        "name": "تيميمون"
      },
      {
        "id": "49002",
        "name": "أولاد سعيد"
      },
      {
        "id": "49008",
        "name": "أوقروت"
      },
      {
        "id": "49009",
        "name": "دلدول"
      },
      {
        "id": "49010",
        "name": "المطارفة"
      },
      {
        "id": "49004",
        "name": "تينركوك"
      },
      {
        "id": "49005",
        "name": "قصر قدور"
      },
      {
        "id": "49006",
        "name": "شروين"
      },
      {
        "id": "49007",
        "name": "طالمين"
      },
      {
        "id": "49003",
        "name": "أولاد عيسى"
      }
    ]
  },
  {
    "id": "50",
    "code": 50,
    "name": "المنيعة",
    "communes": [
      {
        "id": "50025",
        "name": "برج باجي مختار"
      },
      {
        "id": "50028",
        "name": "تيمياوين"
      },
      {
        "id": "50001",
        "name": "برج باجي مختار"
      },
      {
        "id": "50002",
        "name": "تيمياوين"
      }
    ]
  },
  {
    "id": "51",
    "code": 51,
    "name": "أولاد جلال",
    "communes": [
      {
        "id": "51005",
        "name": "أولاد جلال"
      },
      {
        "id": "51006",
        "name": "راس الميعاد"
      },
      {
        "id": "51007",
        "name": "البسباس"
      },
      {
        "id": "51008",
        "name": "سيدي خالد"
      },
      {
        "id": "51009",
        "name": "الدوسن"
      },
      {
        "id": "51001",
        "name": "أولاد جلال"
      },
      {
        "id": "51002",
        "name": "سيدي خالد"
      },
      {
        "id": "51003",
        "name": "راس الميعاد"
      },
      {
        "id": "51004",
        "name": "البسباس"
      },
      {
        "id": "51005",
        "name": "الشعيبة"
      },
      {
        "id": "51006",
        "name": "الدوسن"
      }
    ]
  },
  {
    "id": "52",
    "code": 52,
    "name": "برج باجي مختار",
    "communes": [
      {
        "id": "52003",
        "name": "أولاد خدير"
      },
      {
        "id": "52005",
        "name": "تيمودى"
      },
      {
        "id": "52007",
        "name": "بني عباس"
      },
      {
        "id": "52011",
        "name": "إقلي"
      },
      {
        "id": "52014",
        "name": "الوطى"
      },
      {
        "id": "52018",
        "name": "كرزاز"
      },
      {
        "id": "52019",
        "name": "قصابى"
      },
      {
        "id": "52001",
        "name": "بني عباس"
      },
      {
        "id": "52002",
        "name": "تامترت"
      },
      {
        "id": "52004",
        "name": "كرزاز"
      },
      {
        "id": "52005",
        "name": "تيمودي"
      },
      {
        "id": "52003",
        "name": "بني يخلف"
      },
      {
        "id": "52006",
        "name": "الوطاء"
      },
      {
        "id": "52010",
        "name": "تبلبلة"
      },
      {
        "id": "52007",
        "name": "أولاد خضير"
      },
      {
        "id": "52008",
        "name": "قصابي"
      },
      {
        "id": "52009",
        "name": "أقلي"
      }
    ]
  },
  {
    "id": "53",
    "code": 53,
    "name": "بني عباس",
    "communes": [
      {
        "id": "53003",
        "name": "عـيـن غــار"
      },
      {
        "id": "53008",
        "name": "عين صالح"
      },
      {
        "id": "53010",
        "name": "فقارة الزوى"
      },
      {
        "id": "53001",
        "name": "إن صالح"
      },
      {
        "id": "53002",
        "name": "فقارة الزاوية"
      },
      {
        "id": "53003",
        "name": "إن غار"
      }
    ]
  },
  {
    "id": "54",
    "code": 54,
    "name": "تيميمون",
    "communes": [
      {
        "id": "54004",
        "name": "عين قزام"
      },
      {
        "id": "54001",
        "name": "إن قزام"
      },
      {
        "id": "54002",
        "name": "تين زواتين"
      }
    ]
  },
  {
    "id": "55",
    "code": 55,
    "name": "تقرت",
    "communes": [
      {
        "id": "55007",
        "name": "تبسبست"
      },
      {
        "id": "55008",
        "name": "نزلة"
      },
      {
        "id": "55009",
        "name": "الزاوية العابدية"
      },
      {
        "id": "55010",
        "name": "سيدي سليمان"
      },
      {
        "id": "55013",
        "name": "توقرت"
      },
      {
        "id": "55014",
        "name": "الحجيرة"
      },
      {
        "id": "55015",
        "name": "الطيبات"
      },
      {
        "id": "55016",
        "name": "تماسين"
      },
      {
        "id": "55017",
        "name": "بن ناصر"
      },
      {
        "id": "55018",
        "name": "المنقر"
      },
      {
        "id": "55019",
        "name": "المقارين"
      },
      {
        "id": "55020",
        "name": "العالية"
      },
      {
        "id": "55001",
        "name": "توقرت"
      },
      {
        "id": "55002",
        "name": "نزلة"
      },
      {
        "id": "55003",
        "name": "تبسبست"
      },
      {
        "id": "55004",
        "name": "الزاوية العابدية"
      },
      {
        "id": "55005",
        "name": "تماسين"
      },
      {
        "id": "55006",
        "name": "بلدة عمر"
      },
      {
        "id": "55007",
        "name": "المقارين"
      },
      {
        "id": "55008",
        "name": "سيدي سليمان"
      },
      {
        "id": "55009",
        "name": "الطيبات"
      },
      {
        "id": "55010",
        "name": "بن ناصر"
      },
      {
        "id": "55011",
        "name": "المنقر"
      },
      {
        "id": "55012",
        "name": "الحجيرة"
      },
      {
        "id": "55013",
        "name": "العالية"
      }
    ]
  },
  {
    "id": "56",
    "code": 56,
    "name": "جانت",
    "communes": [
      {
        "id": "56002",
        "name": "جانت"
      },
      {
        "id": "56005",
        "name": "برج الحواس"
      },
      {
        "id": "56001",
        "name": "جانت"
      },
      {
        "id": "56002",
        "name": "برج الحواس"
      }
    ]
  },
  {
    "id": "57",
    "code": 57,
    "name": "عين صالح",
    "communes": [
      {
        "id": "57021",
        "name": "سطيل"
      },
      {
        "id": "57024",
        "name": "تندلة"
      },
      {
        "id": "57028",
        "name": "جامعة"
      },
      {
        "id": "57029",
        "name": "أم الطيور"
      },
      {
        "id": "57030",
        "name": "سيدي عمران"
      },
      {
        "id": "57001",
        "name": "المغير"
      },
      {
        "id": "57002",
        "name": "أم الطيور"
      },
      {
        "id": "57003",
        "name": "سيدي خليل"
      },
      {
        "id": "57004",
        "name": "سطيل"
      },
      {
        "id": "57005",
        "name": "جامعة"
      },
      {
        "id": "57006",
        "name": "سيدي عمران"
      },
      {
        "id": "57007",
        "name": "تندلة"
      },
      {
        "id": "57008",
        "name": "مرارة"
      }
    ]
  },
  {
    "id": "58",
    "code": 58,
    "name": "عين قزام",
    "communes": [
      {
        "id": "58011",
        "name": "حاسي الفحل"
      },
      {
        "id": "58012",
        "name": "حاسي قارة"
      },
      {
        "id": "58001",
        "name": "المنيعة"
      },
      {
        "id": "58002",
        "name": "حاسي القارة"
      },
      {
        "id": "58003",
        "name": "حاسي الفحل"
      }
    ]
  },
  {
    "id": "59",
    "code": 59,
    "name": "آفلو",
    "communes": [
      {
        "id": "59010",
        "name": "قلتة سيدي سعد"
      },
      {
        "id": "59011",
        "name": "عين سيدي علي"
      },
      {
        "id": "59012",
        "name": "بيضاء"
      },
      {
        "id": "59013",
        "name": "بريدة"
      },
      {
        "id": "59014",
        "name": "الغيشة"
      },
      {
        "id": "59016",
        "name": "سبقاق"
      },
      {
        "id": "59019",
        "name": "أفلو"
      },
      {
        "id": "59021",
        "name": "وادي مرة"
      },
      {
        "id": "59024",
        "name": "سيدي بوزيد"
      },
      {
        "id": "59001",
        "name": "آفلو"
      },
      {
        "id": "59002",
        "name": "قلتة سيدي سعد"
      },
      {
        "id": "59003",
        "name": "عين سيدي علي"
      },
      {
        "id": "59004",
        "name": "بيضاء"
      },
      {
        "id": "59005",
        "name": "بريدة"
      },
      {
        "id": "59006",
        "name": "الغيشة"
      },
      {
        "id": "59007",
        "name": "الحاج المشري"
      },
      {
        "id": "59008",
        "name": "سبقاق"
      },
      {
        "id": "59009",
        "name": "تاويالة"
      },
      {
        "id": "59010",
        "name": "وادي مرة"
      },
      {
        "id": "59011",
        "name": "وادي مزي"
      },
      {
        "id": "59012",
        "name": "سيدي بوزيد"
      }
    ]
  },
  {
    "id": "60",
    "code": 60,
    "name": "بريكة",
    "communes": [
      {
        "id": "60007",
        "name": "المعذر"
      },
      {
        "id": "60013",
        "name": "جرمة"
      },
      {
        "id": "60014",
        "name": "بيطام"
      },
      {
        "id": "60029",
        "name": "سقانة"
      },
      {
        "id": "60042",
        "name": "بريكة"
      },
      {
        "id": "60056",
        "name": "أولاد عمار"
      },
      {
        "id": "60001",
        "name": "بريكة"
      },
      {
        "id": "60002",
        "name": "بيطام"
      },
      {
        "id": "60003",
        "name": "عبد القادر عزيل"
      },
      {
        "id": "60004",
        "name": "تيلاطو"
      },
      {
        "id": "60005",
        "name": "سقانة"
      },
      {
        "id": "60006",
        "name": "الجزار"
      },
      {
        "id": "60007",
        "name": "مدوكل"
      },
      {
        "id": "60008",
        "name": "أولاد عمار"
      }
    ]
  },
  {
    "id": "61",
    "code": 61,
    "name": "القنطرة",
    "communes": [
      {
        "id": "61003",
        "name": "البرانس"
      },
      {
        "id": "61017",
        "name": "القنطرة"
      },
      {
        "id": "61018",
        "name": "عين زعطوط"
      },
      {
        "id": "61019",
        "name": "لوطاية"
      },
      {
        "id": "61001",
        "name": "القنطرة"
      },
      {
        "id": "61002",
        "name": "عين زعطوط"
      },
      {
        "id": "61003",
        "name": "البرانس"
      },
      {
        "id": "61004",
        "name": "الوطاية"
      },
      {
        "id": "61005",
        "name": "جمورة"
      }
    ]
  },
  {
    "id": "62",
    "code": 62,
    "name": "بئر العاتر",
    "communes": [
      {
        "id": "62002",
        "name": "بئر العاتر"
      },
      {
        "id": "62009",
        "name": "نقرين"
      },
      {
        "id": "62013",
        "name": "العقلة"
      },
      {
        "id": "62028",
        "name": "فـــــــركـــــان"
      },
      {
        "id": "62001",
        "name": "بئر العاتر"
      },
      {
        "id": "62002",
        "name": "نقرين"
      },
      {
        "id": "62003",
        "name": "العقلة المالحة"
      },
      {
        "id": "62004",
        "name": "فركان"
      }
    ]
  },
  {
    "id": "63",
    "code": 63,
    "name": "العريشة",
    "communes": [
      {
        "id": "63010",
        "name": "الغور"
      },
      {
        "id": "63032",
        "name": "العريشة"
      },
      {
        "id": "63001",
        "name": "العريشة"
      },
      {
        "id": "63002",
        "name": "القور"
      },
      {
        "id": "63003",
        "name": "سيدي الجيلالي"
      },
      {
        "id": "63004",
        "name": "البويهي"
      }
    ]
  },
  {
    "id": "64",
    "code": 64,
    "name": "قصر الشلالة",
    "communes": [
      {
        "id": "64017",
        "name": "سيدي عبد الغنى"
      },
      {
        "id": "64029",
        "name": "قصر الشلالة"
      },
      {
        "id": "64030",
        "name": "الرشايقة"
      },
      {
        "id": "64035",
        "name": "الحمادية"
      },
      {
        "id": "64039",
        "name": "سرغين"
      },
      {
        "id": "64040",
        "name": "بوقرة"
      },
      {
        "id": "64001",
        "name": "قصر الشلالة"
      },
      {
        "id": "64002",
        "name": "زمالة الأمير عبد القادر"
      },
      {
        "id": "64003",
        "name": "الرشايقة"
      },
      {
        "id": "64004",
        "name": "الحمادية"
      },
      {
        "id": "64005",
        "name": "سرغين"
      },
      {
        "id": "64006",
        "name": "بوقرة"
      }
    ]
  },
  {
    "id": "65",
    "code": 65,
    "name": "عين وسارة",
    "communes": [
      {
        "id": "65008",
        "name": "البيرين"
      },
      {
        "id": "65019",
        "name": "سيدي لعجال"
      },
      {
        "id": "65020",
        "name": "حد الصحاري"
      },
      {
        "id": "65021",
        "name": "القرنيني"
      },
      {
        "id": "65031",
        "name": "عين وسارة"
      },
      {
        "id": "65032",
        "name": "بنهار"
      },
      {
        "id": "65033",
        "name": "حاسي فدول"
      },
      {
        "id": "65035",
        "name": "عين افقة"
      },
      {
        "id": "65001",
        "name": "عين وسارة"
      },
      {
        "id": "65002",
        "name": "بيرين"
      },
      {
        "id": "65003",
        "name": "بويرة الأحدب"
      },
      {
        "id": "65004",
        "name": "الخميس"
      },
      {
        "id": "65005",
        "name": "سيدي لعجال"
      },
      {
        "id": "65006",
        "name": "حد الصحاري"
      },
      {
        "id": "65007",
        "name": "قرنيني"
      },
      {
        "id": "65008",
        "name": "بن هار"
      },
      {
        "id": "65009",
        "name": "حاسي فدول"
      },
      {
        "id": "65010",
        "name": "عين فكة"
      }
    ]
  },
  {
    "id": "66",
    "code": 66,
    "name": "مسعد",
    "communes": [
      {
        "id": "66006",
        "name": "سد رحال"
      },
      {
        "id": "66017",
        "name": "مسعد"
      },
      {
        "id": "66022",
        "name": "سلمانة"
      },
      {
        "id": "66029",
        "name": "دلدول"
      },
      {
        "id": "66001",
        "name": "مسعد"
      },
      {
        "id": "66002",
        "name": "سد الرحال"
      },
      {
        "id": "66003",
        "name": "فيض البطمة"
      },
      {
        "id": "66004",
        "name": "القطارة"
      },
      {
        "id": "66005",
        "name": "سلمانة"
      },
      {
        "id": "66006",
        "name": "عمورة"
      },
      {
        "id": "66007",
        "name": "دلدول"
      },
      {
        "id": "66008",
        "name": "أم العظام"
      }
    ]
  },
  {
    "id": "67",
    "code": 67,
    "name": "قصر البخاري",
    "communes": [
      {
        "id": "67007",
        "name": "العمارية"
      },
      {
        "id": "67032",
        "name": "عزيز"
      },
      {
        "id": "67035",
        "name": "قصر البخاري"
      },
      {
        "id": "67038",
        "name": "الشهبونية"
      },
      {
        "id": "67058",
        "name": "أولاد عنتر"
      },
      {
        "id": "67064",
        "name": "سانڨ"
      },
      {
        "id": "67001",
        "name": "قصر البخاري"
      },
      {
        "id": "67002",
        "name": "أولاد معرف"
      },
      {
        "id": "67003",
        "name": "عين بوسيف"
      },
      {
        "id": "67004",
        "name": "دراق"
      },
      {
        "id": "67005",
        "name": "بوعيش"
      },
      {
        "id": "67006",
        "name": "الكاف الأخضر"
      },
      {
        "id": "67007",
        "name": "شلالة العذاورة"
      },
      {
        "id": "67008",
        "name": "أولاد هلال"
      },
      {
        "id": "67009",
        "name": "تفراوت"
      },
      {
        "id": "67010",
        "name": "بوغار"
      },
      {
        "id": "67011",
        "name": "سيدي دامد"
      },
      {
        "id": "67012",
        "name": "عزيز"
      },
      {
        "id": "67013",
        "name": "الشهبونية"
      },
      {
        "id": "67014",
        "name": "شنيقل"
      },
      {
        "id": "67015",
        "name": "عين القصير"
      },
      {
        "id": "67016",
        "name": "أم الجليل"
      },
      {
        "id": "67017",
        "name": "مفاتحة"
      },
      {
        "id": "67018",
        "name": "بوغزول"
      },
      {
        "id": "67019",
        "name": "العوينات"
      },
      {
        "id": "67020",
        "name": "أولاد عنتر"
      },
      {
        "id": "67021",
        "name": "السانق"
      }
    ]
  },
  {
    "id": "68",
    "code": 68,
    "name": "بوسعادة",
    "communes": [
      {
        "id": "68003",
        "name": "حمـام الضلعة"
      },
      {
        "id": "68010",
        "name": "أولاد مـاضي"
      },
      {
        "id": "68011",
        "name": "مقرة"
      },
      {
        "id": "68015",
        "name": "بلعايبة"
      },
      {
        "id": "68017",
        "name": "عين الحجل"
      },
      {
        "id": "68020",
        "name": "بوسعادة"
      },
      {
        "id": "68021",
        "name": "أولاد سيدي ابراهيم"
      },
      {
        "id": "68022",
        "name": "سيدي عامر"
      },
      {
        "id": "68023",
        "name": "تامسة"
      },
      {
        "id": "68024",
        "name": "بن سرور"
      },
      {
        "id": "68029",
        "name": "المعاريف"
      },
      {
        "id": "68030",
        "name": "الدهاهنة"
      },
      {
        "id": "68031",
        "name": "بوطي السايح"
      },
      {
        "id": "68032",
        "name": "خطوطي سد الجير"
      },
      {
        "id": "68041",
        "name": "عين الملح"
      },
      {
        "id": "68043",
        "name": "سليم"
      },
      {
        "id": "68044",
        "name": "عين الريش"
      },
      {
        "id": "68047",
        "name": "جبل مساعد"
      },
      {
        "id": "68001",
        "name": "بوسعادة"
      },
      {
        "id": "68002",
        "name": "الهامل"
      },
      {
        "id": "68003",
        "name": "ولتام"
      },
      {
        "id": "68004",
        "name": "خبانة"
      },
      {
        "id": "68005",
        "name": "مسيف"
      },
      {
        "id": "68006",
        "name": "الحوامد"
      },
      {
        "id": "68007",
        "name": "بن سرور"
      },
      {
        "id": "68008",
        "name": "أولاد سليمان"
      },
      {
        "id": "68009",
        "name": "الزرزور"
      },
      {
        "id": "68010",
        "name": "محمد بوضياف"
      },
      {
        "id": "68011",
        "name": "عين الملح"
      },
      {
        "id": "68012",
        "name": "بير الفضة"
      },
      {
        "id": "68013",
        "name": "عين فارس"
      },
      {
        "id": "68014",
        "name": "سيدي امحمد"
      },
      {
        "id": "68015",
        "name": "عين الريش"
      },
      {
        "id": "68016",
        "name": "أمجدل"
      },
      {
        "id": "68017",
        "name": "أولاد عطية"
      },
      {
        "id": "68018",
        "name": "جبل أمساعد"
      },
      {
        "id": "68019",
        "name": "سليم"
      },
      {
        "id": "68020",
        "name": "سيدي عامر"
      },
      {
        "id": "68021",
        "name": "تامسة"
      },
      {
        "id": "68022",
        "name": "أولاد سيدي إبراهيم"
      },
      {
        "id": "68023",
        "name": "بنزوه"
      }
    ]
  },
  {
    "id": "69",
    "code": 69,
    "name": "الأبيض سيدي الشيخ",
    "communes": [
      {
        "id": "69007",
        "name": "الابيض سيدي الشيخ"
      },
      {
        "id": "69008",
        "name": "عين العراك"
      },
      {
        "id": "69009",
        "name": "أربوات"
      },
      {
        "id": "69013",
        "name": "بوسمغون"
      },
      {
        "id": "69014",
        "name": "شلالة"
      },
      {
        "id": "69019",
        "name": "المھارة"
      },
      {
        "id": "69001",
        "name": "الأبيض سيدي الشيخ"
      },
      {
        "id": "69002",
        "name": "عين العراك"
      },
      {
        "id": "69003",
        "name": "عرباوة"
      },
      {
        "id": "69004",
        "name": "بوسمغون"
      },
      {
        "id": "69005",
        "name": "شلالة"
      },
      {
        "id": "69006",
        "name": "البنود"
      },
      {
        "id": "69007",
        "name": "المهرة"
      }
    ]
  }
];

/** Delivery modes */
export type DeliveryMode = "home" | "office";

export const deliveryModes = [
  { id: "home" as DeliveryMode, label: "التوصيل إلى المنزل", icon: "🏠", price: 600 },
  { id: "office" as DeliveryMode, label: "استلام من مكتب التوصيل", icon: "📦", price: 400 },
];

/** Get delivery price */
export function getDeliveryPrice(mode: DeliveryMode): number {
  return deliveryModes.find((m) => m.id === mode)?.price ?? 600;
}
